#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```terraform
Running plan in the remote backend. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/imagebuilder/imagebuilder-staging/runs/run-jYrzxVnHx8tFPSa1

Waiting for the plan to start...

Terraform v0.14.0
Configuring remote state backend...
Initializing Terraform configuration...
aws_iam_policy.vmimport_s3: Refreshing state... [id=arn:aws:iam::933752197999:policy/vmimport_s3_staging]
aws_iam_user.imagebuilder_worker: Refreshing state... [id=imagebuilder_worker_staging]
aws_iam_user.packer: Refreshing state... [id=packer_staging]
aws_cloudwatch_log_group.external_composer: Refreshing state... [id=external_composer_staging]
aws_s3_bucket.imagebuilder_s3: Refreshing state... [id=imagebuilder.service.staging]
aws_cloudwatch_log_group.internal_composer: Refreshing state... [id=internal_composer_staging]
aws_iam_role.spot_fleet_tagging_role: Refreshing state... [id=imagebuilder_spot_fleet_role_staging]
aws_iam_role.external_composer: Refreshing state... [id=external_composer_staging]
aws_iam_policy.vmimport_ec2: Refreshing state... [id=arn:aws:iam::933752197999:policy/vmimport_ec2_staging]
aws_iam_role.external_worker: Refreshing state... [id=external_worker_staging]
aws_iam_role.internal_worker: Refreshing state... [id=internal_worker_staging]
aws_iam_policy.spotfleet_iam_spot_policy: Refreshing state... [id=arn:aws:iam::933752197999:policy/spotfleet_iam_spot_policy_staging]
aws_iam_policy.packer: Refreshing state... [id=arn:aws:iam::933752197999:policy/packer_staging]
aws_cloudwatch_log_stream.external_composer_syslog: Refreshing state... [id=external_composer_syslog]
aws_iam_role.vmimport: Refreshing state... [id=vmimport_staging]
aws_iam_role.internal_composer: Refreshing state... [id=internal_composer_staging]
aws_iam_instance_profile.external_composer: Refreshing state... [id=external_composer_staging]
aws_cloudwatch_log_stream.internal_composer_syslog: Refreshing state... [id=internal_composer_syslog]
aws_iam_role_policy_attachment.spotfleet_iam_role_policy: Refreshing state... [id=imagebuilder_spot_fleet_role_staging-20201204204656385800000003]
aws_iam_instance_profile.external_worker: Refreshing state... [id=external_worker_staging]
aws_iam_policy.external_cloudwatch_logging: Refreshing state... [id=arn:aws:iam::933752197999:policy/external_cloudwatch_logging_staging]
aws_iam_policy.internal_composer_read_keys: Refreshing state... [id=arn:aws:iam::933752197999:policy/internal_composer_read_keys_staging]
aws_iam_role_policy_attachment.spotfleet_iam_spot_policy: Refreshing state... [id=imagebuilder_spot_fleet_role_staging-20201204204656553800000004]
aws_iam_policy.external_worker_read_keys: Refreshing state... [id=arn:aws:iam::933752197999:policy/external_worker_read_keys_staging]
aws_iam_policy.internal_worker_read_keys: Refreshing state... [id=arn:aws:iam::933752197999:policy/internal_worker_read_keys_staging]
aws_iam_role_policy_attachment.vmimport_s3: Refreshing state... [id=vmimport_staging-20201204204656723700000009]
aws_iam_policy.external_composer_read_keys: Refreshing state... [id=arn:aws:iam::933752197999:policy/external_composer_read_keys_staging]
aws_iam_role_policy_attachment.vmimport_ec2: Refreshing state... [id=vmimport_staging-20201204204656576600000006]
aws_iam_instance_profile.internal_worker: Refreshing state... [id=internal_worker_staging]
aws_iam_user_policy_attachment.imagebuilder_vmimport: Refreshing state... [id=imagebuilder_worker_staging-20201204204656609900000007]
aws_iam_user_policy_attachment.packer: Refreshing state... [id=packer_staging-20201204204656365500000001]
aws_iam_instance_profile.internal_composer: Refreshing state... [id=internal_composer_staging]
aws_security_group.internal_allow_trusted: Refreshing state... [id=sg-084607083aaa39727]
aws_security_group.internal_allow_egress: Refreshing state... [id=sg-0eb65fd8f2c17dba5]
aws_vpc_endpoint.internal_vpc_s3: Refreshing state... [id=vpce-08d5fdb7cd26e5c94]
aws_iam_role_policy_attachment.external_cloudwatch_composer: Refreshing state... [id=external_worker_staging-20210113203644009900000001]
aws_iam_role_policy_attachment.external_cloudwatch_worker: Refreshing state... [id=external_composer_staging-20210113203644029600000002]
aws_iam_role_policy_attachment.external_worker_read_keys: Refreshing state... [id=external_worker_staging-20210113202541913700000002]
aws_iam_policy.internal_cloudwatch_logging: Refreshing state... [id=arn:aws:iam::933752197999:policy/internal_cloudwatch_logging_staging]
aws_iam_role_policy_attachment.internal_composer_read_keys: Refreshing state... [id=internal_composer_staging-20201204204656559200000005]
aws_iam_role_policy_attachment.external_composer_read_keys: Refreshing state... [id=external_composer_staging-20210113202541907800000001]
aws_iam_role_policy_attachment.internal_worker_read_keys: Refreshing state... [id=internal_worker_staging-20201204204656366800000002]
aws_vpc_endpoint.internal_vpc_cloudwatch_logs: Refreshing state... [id=vpce-01e031ba5033ab0c5]
aws_vpc_endpoint.internal_vpc_secretsmanager: Refreshing state... [id=vpce-0d13154306549b1cd]
aws_iam_policy.imagebuilder_workers_s3: Refreshing state... [id=arn:aws:iam::933752197999:policy/imagebuilder_workers_s3_staging]
aws_iam_role_policy_attachment.internal_cloudwatch_worker: Refreshing state... [id=internal_composer_staging-2020120420465704340000000a]
aws_security_group.external_vpc_endpoints: Refreshing state... [id=sg-0be443e4c92c98b1c]
aws_vpc_endpoint.external_vpc_s3: Refreshing state... [id=vpce-0249da6b762fae5de]
aws_security_group.external_workers: Refreshing state... [id=sg-0f578bf2872026f5d]
aws_iam_role_policy_attachment.internal_cloudwatch_composer: Refreshing state... [id=internal_worker_staging-2020120420465704850000000b]
aws_ebs_volume.composer_internal: Refreshing state... [id=vol-058d1cec56397f102]
aws_network_interface.composer_internal: Refreshing state... [id=eni-07088640399f60f49]
aws_iam_user_policy_attachment.imagebuilder_s3: Refreshing state... [id=imagebuilder_worker_staging-2020120420465705150000000c]
aws_vpc_endpoint.external_vpc_cloudwatch_logs: Refreshing state... [id=vpce-0ffb71834c608a4e5]
aws_vpc_endpoint.external_vpc_secretsmanager: Refreshing state... [id=vpce-013676c2939c3d681]
aws_security_group.external_composer: Refreshing state... [id=sg-0be4cfbfac3cc0022]
aws_instance.composer_internal: Refreshing state... [id=i-0aca0a6ea3ad2b2bf]
aws_ebs_volume.composer_external: Refreshing state... [id=vol-0daeecfc25da04a05]
aws_network_interface.composer_external: Refreshing state... [id=eni-02f250427cdd85dc7]
aws_eip.lb: Refreshing state... [id=eipalloc-0f8be222c563c4767]
aws_instance.composer_external: Refreshing state... [id=i-0e5235dca9bc82294]
aws_volume_attachment.composer_internal: Refreshing state... [id=vai-3259574331]
aws_launch_template.worker_internal_x86: Refreshing state... [id=lt-0aae9d85fdd3f7067]
aws_spot_fleet_request.workers_internal_x86: Refreshing state... [id=sfr-ea71ad26-bed8-44b6-a4dd-29b75a08498e]
aws_volume_attachment.composer_external: Refreshing state... [id=vai-3851513267]
aws_launch_template.worker_external_x86: Refreshing state... [id=lt-04e6df10bd74694e7]
aws_spot_fleet_request.workers_external_x86: Refreshing state... [id=sfr-bc523d73-f1d6-48b6-91de-5ee7ddff59ca]

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement
 <= read (data resources)

Terraform will perform the following actions:

  # data.template_cloudinit_config.external_workers_cloud_init will be read during apply
  # (config refers to values not yet known)
 <= data "template_cloudinit_config" "external_workers_cloud_init"  {
      ~ id            = "2597049277" -> (known after apply)
      ~ rendered      = "H4sIAAAAAAAA/9R4WXOrSJr2vSLqP/C5TsTXHWeQWIRkucsVLSTQSiISkq1nwpFASiBSgCG1njr/fUK2fNpnqenumb4p39hkvls+PPm8Lx6VBSMF451zRR643Z6yrMI16+yyE0n+wkXlvkhwfX68M2aGppoIjIcwuGtdn3iX1E1WFg+c2BZ+av3U4vn3Rj+13mKPs6Yqm4y92GLGcJzuSMH+wq0zSgq8I493WZGxdrze3P3dy6lx0axJzWtFXCZZsXng+lHG3hm8lMzIiXViWu4TPi6Ldbb5qWVkO/JdcT+/t2m19g2pm4cWx/HctYIHjsQSf11scRzHNU36hPcsLevsQpKnnJxfbK8/PHfXNClfN5gbDodDVQYXPBLPsaRdH8dDa6gOh8PR0Bqdtmt9NqOT9agYZDGdnnderam1gyS67LHcnjgiqfrJaHU5itug5xWpRVe+UZFVnYET8OnkPvbMQQfqlZoIl4F+BOeP+XqTDtb7Mwi6g9lHA/fMs+OqGyUFpX5aQ3+iZFMWd2yLFpGmZ4vKzrs0q8quFTKV7TbD501uD3vjS3reRL29YgyykzM7dT11u7cNYeJbF7CtyPqcefuPzQx+TCVUW/liqO73s8CK6i39qKfuDi8P9eHsmNK+MdmhCNRtGq2OZ7MveastrhZJZ5A6+HmliUf93EO6VPhxd7U5CpvMinpNFunOpQ8ccvJkxRrcP1eW6RnBIq42YU1tPJ0uQttI2cXsG0lYm0sd+aUtDsnw3N2kLAa1qTo0UuzDqi9fLsKzCnUpHpldUzhWyvH4vEoPR6lgkVw5yxVLCJt/dBXBWhVV4Z9tuwgr6aIfYyKJkX/q9Yt0QIt0WYebLenHpVWshvqpE1O5p9nz8ybbr2L1+DEX74M9DQwfPWOV5cf5MofbcbV1fIkoxlzsleN+M5/G3Y6n5Of18pAYjZsmz+LIn05c16wu5SYSBoobZAL09aoIYUck7mbUgR8998yCdXAv1GvXjJNhKU3CdTFXLgFE/nw+MMIcF6eTrPWRmeXaHAwatJUE4dIbnc/CbD17dqK5qCrr/jqRcQzrZXccByjRZx1RPQOvp4vbfhxmw4k5X4Do4uuCI7P1/UkgovX4yO3wtqz/WpMkxawdl7u7r/lOEklRxMEL50evnKfheCYCR1Oua7OVKm512q16uqNmp6nTO5p5z78vtp2wT8oVsLSOIRwX3XtlwZXRPsHZV8laxzpj5OmqCLdrWWGWPnAdtqter/fTVSOeDrhuXiqLX1XggfvtVqhpq2i2HD+NTMOYOY/3cozX94JAFEmRulFX7K77ayVaK5gIiRwPRCm+H4gD6eY9Mo2VaWvwzX0QSYnSU5Su0lckWb7vd8VIJhImeH3fl3t9Isn4Xkq63yYfPo006DwubYEtbXEEUTJ3MnUM3TmyUTi3BB3Blz2BjXJxbiOouRoYW17oh4Iu22iuhgJ10RhYhhRcgKtOUK6IkRQKZGcozjiX4CRFkQTVRIDQQ9UyEqs5noZbJ9chRMeFRXU1EcJn6LrAyunUcnQXIl1OhFNmCEoV6kkTi9UY+OE28oBsT9Ktk4vPlp+sXM3tOS4MCRI11wE+ngDT8Ss1OVbXve5Xe7nuO+4cJoJbeAh6yNU1qOlCsjPO9lZPXTmtnYmgELfqWQJQkUBlqOuhnbODl9My2QFz9FLzfISQroVSoiNN115svcH4+mzlOrAKtfZcPbBdYASXdOl5FUAuLUihQhMB1RDnS2OXzOBYPQW+fkm2m0XgzrdubkiAGkqYpyeI0Amjk+tp97IxnkOydS9YqkpDrk7OlE7RNpURDQ5LCcwNb3aKt6pL3MoJhBM2xFh23epsHUsBjOEukMuL49NupIOeK7ohEtXCyukSTxLVnOosppVteINd4MEzmbq2M2KXKA8122NdQ47r4KIvQtfdGzvQGHpSjagreOP5FIrhGNIEOJJ+CHNYe7o7hoW7tKfJAnnJxJnCi60B7Hlgl9DEs/UKg7zbTYTkaFAde85MCS6pGPnqs+EOF0gLG08zuuFEx44mpp5OM+iowPahZ2hgZheqDAV6DAq6j1yKohG7wMKVojE8uBPxTKblgfhpL9ag5ObiKs71eWRV3Uhq5Ji6zJ26OZy4OhLnI0dKVAMxMUCi7U7d1PZVGF3meSSHp8VleIK74GKh7tlFQE0EV7U83XQ1cQL9ZIZcqo1oaBvaYGRRqsO8lEMnDAw5P4aTQRPbg0VAwyrIaZVIcI/EYQ1ycWRqiWq4bm77CfSQOAqQPrG3CQV0cyGOmkfScfE7vuqbL/QT3coGMkIhsJA4sryg++N7dfrCUWtTqbCoJCBRaguxEunVMs5nZ8cTMdb0k61Rg3in1JGpFzuxDC905LhzBAtw9AokGNOZDEUoBwIsk91GhAgcbF3PRrtTnThqANAgCAUoeVMwiieDiT2dS4bGVrZ3coDoLgw/OIJJc7ApLbxpXEeTCrlT42D61THapra7O7F4ig5QEFeOgxbIm0/RiJl46+L44u6gEPpY68qOMxORx1xzPF9E05Taud4gP51Z0mmMJm4X5QAEjq4Afyi7E6Uwx+rSpolAXNUyrUpAUgKsYigD17VD714ACHWRVp3tYnjBU3oA+rxrunMIJXYmHrBtP9lZeSphOQX2LtzHkiF79kACHhXhNmVEE3ujLRCCvFQWQqVApIv2tDwFeSLGCAQLWV8gF6JkNIDRJTgneeIHKFeQGC4DanQDNzWsy9wEhb7F3vwUb1E33ELNzq2FXYDGse/leAqUeKsfgA+FIJ/vAc1FyzcGo+xVkyFStJkGdEThHOZ0bLlQf9VyYfFtp5iatvOIj821gVVlQ+p22UT7jCbtst58azwcj6Fm249iX2rLYrvXbYvizcYz4UKDT7a9fFpogf00hOAR18UDPjYPDYlrwpodLvCG1A/7hie4Ybz4MJDlviKJg/5gMLhZPUQ1Ob7MqnxfR4TQW3wbqfYIzlbOzARPxhAMJ7c2NwTj/32yZh81cZ1V16mev7nwcbnb4SLhcyug5eAtf2A7mvECFxga2tMKavrMf2wY3mTFhicnRuoCU/5Y1vlt/n4H3HgGHzuExZ0buPwb2m/RtRHUHPvLwTQwXpkz4DwhuHxMGauah07n65O1v5ysjXf4Uha3l9h5P3f8KOV3C21W7uiPx5G/5eU2+6/bA6a0PJLkKSl3OCsa7pH7G3fHCN69p8zdf3B36T5qX1/jt+uv2Hy/xb1liDH3yN39uOoY83HN2hW5zlm36l4D/sv1/dvq+P2vxX/lu+/ENymh9JWIv/fh9/86UVZ0ItykrYYwjif7kquyiqxxRltNua9j8uMxs/UzNyGMYynhsqJhuIgJNxu3WzNgO0Mw0p5m48cPf4r3NeX4ZcNdyfbQ6Yi9QVtSuu3b7w7FjDSssyMM8wlmuPMWi8+SP19zDJuG7CJKuLRs2PVjtN3S0XL55cI83n349OM79Jn/8OldMZ/bv6dGd9c8qzorGFfuX09UkOO7hCROS+7OJoxlxYZrzg0juy/bHCu5D5++qulz+yWkfYPnG4d26+2vmFGuIYz/EurDV2H+GDS4gfMqeNEVoC90YCUHp+AVDEg2WcNI/TVhjhlLX2xanX1Td2gZY/pSCT423Ne6xG0I41+X+AOme8L951WR3payhPvw6R+J+WfuN277zPE1d9e2X/xsVmfF5o779fV073X76Zb46abb7W1TFq039//J8u6fDMb9xr0gXu84fv3PFtD6UW+5/eOI43m8Z+UfiThjUtHyzF0bM7cua+5VQ5tX0tw2r5R5u7jcaMjFpGbZOosxI+1WhBvS63J8wvHcL7/8wn349M3n5mfuV+7Dp/ct8/M7sf29NDk5c7hIvs71byHpDyaaf8jLV1Rexpevafj3jbsfW75y7AtC30Px6sDn5PwCxzeB45r9HwO/4fyO5N+d5o/H15ceftXtH7D2qvv76p1J62fOMcfmn3YpPiek+PMD511bDEmuChmXxYHU106RNdfnMbC5a1esuWNKCu5IOIr3RZy2WzFmLwy/e4f0bXL+/B79a//4fMf9+uv7Ev5AEL812n11w5VrSH3IYnLDd1WTCteE+3aE+v8NV5Ndyci3bi8XuSnjnLCm3Xptx9feSwp8nSx4viiPX6K9hrjN23/9FtaH+74gfAcmz//U+u8AAAD//5sp6VQsGAAA" -> (known after apply)
        # (2 unchanged attributes hidden)

      ~ part {
          ~ content      = <<-EOT
                #cloud-config
                
                users:
                  - name: ec2-user
                    ssh_authorized_keys:
                      - "ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAACAQCxjfFIIlGfCn9iclHymWrEBrTU2lL6tkSGT1ep7dCPzw1jY6WnhQlPXMpePriNxNXlG8cWO9/RFpBd0z9FwNy+kfgh9fuyNY49I+Ma6OyTVBg5hNoFxfRXG5iHtc/SQlnbEFiKpSk4lipo4QZtBtmgAqgkSA6Dzhygb6u5M9ixTIx4WBjuSM0GXQzNjpefyiWu+sIR+h2UrQkKABuuIYQbrjl+FhVmaLvrvyTO2usOtvnYBjhbPwyO72WPjapKd/9hTaqPE1wFy6UF2nXc4Pgw0giQb6sibFTz7NTexW35Q98qpQOWMYKcpgZrlSaHHKZSMhtzO7MdZrOLFUXoS1AeAy4ghtcNrOBTlb5SvP73zz0qBRF2cCO4O0wp5wwqPhvw2ntb3pTLPtdetJ+V50QPnpnXySSnZp2zFwce21bXx67nh9lnhLrZgje7coQnPAFx/cl36ESJygiuPcBw+k18YulYMXUqaBtkwJLkRjDpjTX2e5MJ16oD7sJHc4/W5kyfLvdMsVhdq1CXHGVVOpzogb095VYi0RXFpnZR/1eVgC/R+WVytYfY80rfVOcdAo2GZfnJ5zYRUXJJ9MZkanxx3E7UOikEJN9sUj200z6Cyy0IfIqTbJ1B5f7fd3acRrL4DcYUdFI/1ByNW6F1j7cZiAGOJKNbzXF0T3tf8x0e1Q== major@redhat.com"
                      - "ssh-ed25519 AAAAC3NzaC1lZDI1NTE5AAAAIPB1jFl4p6FTBixHT6wOk6X8nj/Z7eoPNQE/M0wK485K obudai@redhat.com"
                
                write_files:
                  - path: /tmp/cloud_init_vars
                    content: |
                      OSBUILD_COMMIT=83caf800e52524b414f7f5bf5ae0d3c912c89192
                      COMPOSER_COMMIT=9b2d565545752338741b3e2aeaf87367e23a82d4
                      OSBUILD_CA_CERT=LS0tLS1CRUdJTiBDRVJUSUZJQ0FURS0tLS0tCk1JSUREVENDQWZXZ0F3SUJBZ0lVUDNQM2YzNVBGUk51b2Z0emM5TDk2RGhUb2RBd0RRWUpLb1pJaHZjTkFRRUwKQlFBd0ZqRVVNQklHQTFVRUF3d0xiM05pZFdsc1pDNXZjbWN3SGhjTk1qQXdPVEV6TVRZeU1EVTNXaGNOTXpBdwpPVEV4TVRZeU1EVTNXakFXTVJRd0VnWURWUVFEREF0dmMySjFhV3hrTG05eVp6Q0NBU0l3RFFZSktvWklodmNOCkFRRUJCUUFEZ2dFUEFEQ0NBUW9DZ2dFQkFNQnBrWVFYSVNMYzhLWWpNUVlnenBROUNBM1JLMmdIRDBxYXFzdjgKYVJjVkM2NlM5ZkhxRUUxaUxVWE83MDJRejVza2poM3pxTHlHUjh3UlYvL2NJMWIxcjBVeVpTY0xaM1c3VVpyQwo0NDRmY3ozTXl4bFN6V1VZU1BnQklLaGdBOHFtclpSMW9mYWRyeHVSTCtzbkZESWt4M3crYzFKZVVuMmNsMFdpClV0WDJHR1ZDRldNT2FvZkRrWFVDRnVLSHdKUWdGTHRzSENaWWNmdldWSFpaNk44d0dwMlFaWTI5Yzh1bXBqMVAKUEZsWEM4ZGFaTE1hWFliRTBNSXRWMENISnB3R0lwYnlubVlUbCtzRnV2bDRvVG1yeHoveXh6cER2Vk1PckFJbQp4b2s3clVtVHVkRGVFU1JCT2dBMUt1YU1SVHVhSXBRbzJkb3ZxKzAxRmYzQU4yVUNBd0VBQWFOVE1GRXdIUVlEClZSME9CQllFRko3ZTZYM3kwZG9scS9KYlZpYklpd2RuU1ArNk1COEdBMVVkSXdRWU1CYUFGSjdlNlgzeTBkb2wKcS9KYlZpYklpd2RuU1ArNk1BOEdBMVVkRXdFQi93UUZNQU1CQWY4d0RRWUpLb1pJaHZjTkFRRUxCUUFEZ2dFQgpBRnp2N2llS0c5bFpLckIyTW1aaEFxSElMeWxhT3lWcTc3RzlCTVJURnNwWnU0MHI3R1R3Y0Rodmg1RUNvSFFiCmxrdTBYNU9YZ0R2WHNCcG9GSHJ2MEtPSWxTN1VKMXYwNGsvSllnWHcrbGpUVHMvOXpwbjhSVmxtcHUvR01PTTUKUWJHUCtOajVaczVmR0ZXaE43TTI1UWtVODJKbHhlSkFsUXhIQ2xDUGV4UkNNYTF5NXA3VG5nODBLSld0eVBQOQp0U2dNQnA3NVVSZW80NUU4UEpySnAzaHlvNFJ4OVJRR2tyeWNSSXdmQkh2a3hNSmZuc2M3WS92NWl1RjhteE16CjN0Yko5K0p5RUF1SHoxYkd1cUNYK3FKUVRUdC9RbzYydkdXYUk5U1ZLYlM4YVhMQzJONnFjaWJxcjU4ZjRESkQKSnNsTS83cHN5cjFvNXR0YkJuNlk1QXM9Ci0tLS0tRU5EIENFUlRJRklDQVRFLS0tLS0K
                      COMPOSER_HOST=aws.composer.osbuild.org
                      COMPOSER_ADDRESS=172.31.64.11
                      WORKER_SSL_KEYS_ARN=arn:aws:secretsmanager:us-east-1:933752197999:secret:brew_keys-7FUeel
                      SUBSCRIPTION_MANAGER_COMMAND_ARN=arn:aws:secretsmanager:us-east-1:933752197999:secret:subscription-manager-command-kQYlo9
                      SYSTEM_HOSTNAME_PREFIX=staging-external-worker
                      COMPOSER_DIR=/etc/osbuild-composer
                      SECRETS_MANAGER_ENDPOINT_URL=https://secretsmanager.us-east-1.amazonaws.com/
                  - path: /etc/osbuild-composer/osbuild-composer.toml
                    content: |
                      [koji]
                      allowed_domains = [ "team.osbuild.org", "hub.brew.osbuild.org", "worker.brew.osbuild.org" ]
                      ca = "/etc/osbuild-composer/ca-crt.pem"
                
                      [worker]
                      allowed_domains = [ "team.osbuild.org", "worker.brew.osbuild.org" ]
                      ca = "/etc/osbuild-composer/ca-crt.pem"
            EOT -> (known after apply)
            # (2 unchanged attributes hidden)
        }
      ~ part {
            # (2 unchanged attributes hidden)
        }
      ~ part {
            # (2 unchanged attributes hidden)
        }
      ~ part {
            # (2 unchanged attributes hidden)
        }
      ~ part {
            # (2 unchanged attributes hidden)
        }
      ~ part {
            # (2 unchanged attributes hidden)
        }
    }

  # data.template_cloudinit_config.internal_workers_cloud_init will be read during apply
  # (config refers to values not yet known)
 <= data "template_cloudinit_config" "internal_workers_cloud_init"  {
      ~ id            = "1590038213" -> (known after apply)
      ~ rendered      = "H4sIAAAAAAAA/9R4WXOrSJr2vSLqP/C5TsTXHWeQWIRkucsVLSTQSiISkq1nwpFASiBSgCG1njr/fUK2fNpnqenumb4p39hkvls+PPm8Lx6VBSMF451zRR643Z6yrMI16+yyE0n+wkXlvkhwfX68M2aGppoIjIcwuGtdn3iX1E1WFg+c2BZ+av3U4vn3Rj+13mKPs6Yqm4y92GLGcJzuSMH+wq0zSgq8I493WZGxdrze3P3dy6lx0axJzWtFXCZZsXng+lHG3hm8lMzIiXViWu4TPi6Ldbb5qWVkO/JdcT+/t2m19g2pm4cWx/HctYIHjsQSf11scRzHNU36hPcsLevsQpKnnJxfbK8/PHfXNClfN5gbDodDVQYXPBLPsaRdH8dDa6gOh8PR0Bqdtmt9NqOT9agYZDGdnnderam1gyS67LHcnjgiqfrJaHU5itug5xWpRVe+UZFVnYET8OnkPvbMQQfqlZoIl4F+BOeP+XqTDtb7Mwi6g9lHA/fMs+OqGyUFpX5aQ3+iZFMWd2yLFpGmZ4vKzrs0q8quFTKV7TbD501uD3vjS3reRL29YgyykzM7dT11u7cNYeJbF7CtyPqcefuPzQx+TCVUW/liqO73s8CK6i39qKfuDi8P9eHsmNK+MdmhCNRtGq2OZ7MveastrhZJZ5A6+HmliUf93EO6VPhxd7U5CpvMinpNFunOpQ8ccvJkxRrcP1eW6RnBIq42YU1tPJ0uQttI2cXsG0lYm0sd+aUtDsnw3N2kLAa1qTo0UuzDqi9fLsKzCnUpHpldUzhWyvH4vEoPR6lgkVw5yxVLCJt/dBXBWhVV4Z9tuwgr6aIfYyKJkX/q9Yt0QIt0WYebLenHpVWshvqpE1O5p9nz8ybbr2L1+DEX74M9DQwfPWOV5cf5MofbcbV1fIkoxlzsleN+M5/G3Y6n5Of18pAYjZsmz+LIn05c16wu5SYSBoobZAL09aoIYUck7mbUgR8998yCdXAv1GvXjJNhKU3CdTFXLgFE/nw+MMIcF6eTrPWRmeXaHAwatJUE4dIbnc/CbD17dqK5qCrr/jqRcQzrZXccByjRZx1RPQOvp4vbfhxmw4k5X4Do4uuCI7P1/UkgovX4yO3wtqz/WpMkxawdl7u7r/lOEklRxMEL50evnKfheCYCR1Oua7OVKm512q16uqNmp6nTO5p5z78vtp2wT8oVsLSOIRwX3XtlwZXRPsHZV8laxzpj5OmqCLdrWWGWPnAdtqter/fTVSOeDrhuXiqLX1XggfvtVqhpq2i2HD+NTMOYOY/3cozX94JAFEmRulFX7K77ayVaK5gIiRwPRCm+H4gD6eY9Mo2VaWvwzX0QSYnSU5Su0lckWb7vd8VIJhImeH3fl3t9Isn4Xkq63yYfPo006DwubYEtbXEEUTJ3MnUM3TmyUTi3BB3Blz2BjXJxbiOouRoYW17oh4Iu22iuhgJ10RhYhhRcgKtOUK6IkRQKZGcozjiX4CRFkQTVRIDQQ9UyEqs5noZbJ9chRMeFRXU1EcJn6LrAyunUcnQXIl1OhFNmCEoV6kkTi9UY+OE28oBsT9Ktk4vPlp+sXM3tOS4MCRI11wE+ngDT8Ss1OVbXve5Xe7nuO+4cJoJbeAh6yNU1qOlCsjPO9lZPXTmtnYmgELfqWQJQkUBlqOuhnbODl9My2QFz9FLzfISQroVSoiNN115svcH4+mzlOrAKtfZcPbBdYASXdOl5FUAuLUihQhMB1RDnS2OXzOBYPQW+fkm2m0XgzrdubkiAGkqYpyeI0Amjk+tp97IxnkOydS9YqkpDrk7OlE7RNpURDQ5LCcwNb3aKt6pL3MoJhBM2xFh23epsHUsBjOEukMuL49NupIOeK7ohEtXCyukSTxLVnOosppVteINd4MEzmbq2M2KXKA8122NdQ47r4KIvQtfdGzvQGHpSjagreOP5FIrhGNIEOJJ+CHNYe7o7hoW7tKfJAnnJxJnCi60B7Hlgl9DEs/UKg7zbTYTkaFAde85MCS6pGPnqs+EOF0gLG08zuuFEx44mpp5OM+iowPahZ2hgZheqDAV6DAq6j1yKohG7wMKVojE8uBPxTKblgfhpL9ag5ObiKs71eWRV3Uhq5Ji6zJ26OZy4OhLnI0dKVAMxMUCi7U7d1PZVGF3meSSHp8VleIK74GKh7tlFQE0EV7U83XQ1cQL9ZIZcqo1oaBvaYGRRqsO8lEMnDAw5P4aTQRPbg0VAwyrIaZVIcI/EYQ1ycWRqiWq4bm77CfSQOAqQPrG3CQV0cyGOmkfScfE7vuqbL/QT3coGMkIhsJA4sryg++N7dfrCUWtTqbCoJCBRaguxEunVMs5nZ8cTMdb0k61Rg3in1JGpFzuxDC905LhzBAtw9AokGNOZDEUoBwIsk91GhAgcbF3PRrtTnThqANAgCAUoeVMwiieDiT2dS4bGVrZ3coDoLgw/OIJJc7ApLbxpXEeTCrlT42D61THapra7O7F4ig5QEFeOgxbIm0/RiJl46+L44u6gEPpY68qOMxORx1xzPF9E05Taud4gP51Z0mmMJm4X5QAEjq4Afyi7E6Uwx+rSpolAXNUyrUpAUgKsYigD17VD714ACHWRVp3tYnjBU3oA+rxrunMIJXYmHrBtP9lZeSphOQX2LtzHkiF79kACHhXhNmVEE3ujLRCCvFQWQqVApIv2tDwFeSLGCAQLWV8gF6JkNIDRJTgneeIHKFeQGC4DanQDNzWsy9wEhb7F3vwUb1E33ELNzq2FXYDGse/leAqUeKsfgA+FIJ/vAc1FyzcGo+xVkyFStJkGdEThHOZ0bLlQf9VyYfFtp5iatvOIj821gVVlQ+p22UT7jCbtst58azwcj6Fm24+i0JaFtnjfFsWbiWfChQafbHv5tNAC+2kIwSOuiwd8bB4aEteENTtc4A2pH/YNT3DDePFhIMt9RRIH/cFgcLN6iGpyfBlV+b6OCKG3+DZS7RGcrZyZCZ6MIRhObl1uCMb/+2TNPmriOquuQz1/c+HjcrfDRcLnVkDLwVv+wHY04wUtMDS0pxXU9Jn/2DC8yYoNnxWM1AWm/LGs89v4/Q638Qw+dgiLOzds+Tew36JrI6g59peDaWC8MmfAeUJw+ZgyVjUPnc6higkvJKIsKl1Z6CndQSTGCT+4nOr+RTm0vz55+8vJ21fHNt7hS1ncXnTn/Wzyo7q+W2izckd/PLL8LS+32X/dHjCl5ZEkT0m5w1nRcI/c37g7RvDuPa3u/oO7S/dR+/quv11/BfD7Le4tQ4y5R+7ux1XHmI9r1q7IdRa7Vfca8F+u799Wx+9/Uf4r34YnvkkJpa9s/b2Pw//XibKiE+EmbTWEcTzZl1yVVWSNM9pqyn0dkx+Poq2fuQlhHEsJlxUNw0VMuNm43ZoB2xmCkfY0Gz9++FO8rynHLxvuysiHTkfsDdqS0m3ffncoZqRhnR1hmE8ww523WHyW/PmaY9g0ZBdRwqVlw64frO2WjpbLL7fq8e7Dpx9ftM/8h0/vivnc/j3FurvmWdVZwbhy/3qighzfJSRxWnJ3NmEsKzZcc24Y2X3Z5ljJffj0VU2f2y8h7Rs83zi0W29/xYxyDWH8l1Afvgrzx6DBDZxXVYyuAH2hAys5OAWvYECyyRpG6q8Jc8xY+mLT6uybukPLGNOXSvCx4b4WJ25DGP+6xB8w3RPuP6+K9LaUJdyHT/9I8T9zv3HbZ46vubu2/eJnszorNnfcr6+ney/uT7fETzdxb2+bsmi9uf9Plnf/ZDDuN+4F8XrH8et/toDWjxrQ7Z9LHM/jPSv/SMQZk4qWZ+7avbl1WXOvGtq8kua2eaXM28XlRkMuJjXL1lmMGWm3ItyQXpfjE47nfvnlF+7Dp28+ST9zv3IfPr3vq5/fie3vpcnJmcNF8nWufwtJfzD2/ENevqLyMuN8TcO/b9z92PKVY18Q+h6KVwc+J+cXOL4JHNfs/xj4Ded3JP/uNH88vr708Ktu/4C1V93fV+9MWj9zjjk2/7RL8TkhxZ8fOO/aYkhyVci4LA6kvnaKrLk+j4HNXbtizR1TUnBHwlG8L+K03Yoxe2H43Tukb9P15/foX/vH5zvu11/fl/AHgvit0e6rG65cQ+pDFpMbvquaVLgm3Lcj1P9vuJrsSka+dXu5yE0Z54Q17dZrO772XlLg62TB80V5/BLtNcRtKP/rt7A+3PcF4Tswef6n1n8HAAD//zgWMAdQGAAA" -> (known after apply)
        # (2 unchanged attributes hidden)

      ~ part {
          ~ content      = <<-EOT
                #cloud-config
                
                users:
                  - name: ec2-user
                    ssh_authorized_keys:
                      - "ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAACAQCxjfFIIlGfCn9iclHymWrEBrTU2lL6tkSGT1ep7dCPzw1jY6WnhQlPXMpePriNxNXlG8cWO9/RFpBd0z9FwNy+kfgh9fuyNY49I+Ma6OyTVBg5hNoFxfRXG5iHtc/SQlnbEFiKpSk4lipo4QZtBtmgAqgkSA6Dzhygb6u5M9ixTIx4WBjuSM0GXQzNjpefyiWu+sIR+h2UrQkKABuuIYQbrjl+FhVmaLvrvyTO2usOtvnYBjhbPwyO72WPjapKd/9hTaqPE1wFy6UF2nXc4Pgw0giQb6sibFTz7NTexW35Q98qpQOWMYKcpgZrlSaHHKZSMhtzO7MdZrOLFUXoS1AeAy4ghtcNrOBTlb5SvP73zz0qBRF2cCO4O0wp5wwqPhvw2ntb3pTLPtdetJ+V50QPnpnXySSnZp2zFwce21bXx67nh9lnhLrZgje7coQnPAFx/cl36ESJygiuPcBw+k18YulYMXUqaBtkwJLkRjDpjTX2e5MJ16oD7sJHc4/W5kyfLvdMsVhdq1CXHGVVOpzogb095VYi0RXFpnZR/1eVgC/R+WVytYfY80rfVOcdAo2GZfnJ5zYRUXJJ9MZkanxx3E7UOikEJN9sUj200z6Cyy0IfIqTbJ1B5f7fd3acRrL4DcYUdFI/1ByNW6F1j7cZiAGOJKNbzXF0T3tf8x0e1Q== major@redhat.com"
                      - "ssh-ed25519 AAAAC3NzaC1lZDI1NTE5AAAAIPB1jFl4p6FTBixHT6wOk6X8nj/Z7eoPNQE/M0wK485K obudai@redhat.com"
                
                write_files:
                  - path: /tmp/cloud_init_vars
                    content: |
                      OSBUILD_COMMIT=83caf800e52524b414f7f5bf5ae0d3c912c89192
                      COMPOSER_COMMIT=9b2d565545752338741b3e2aeaf87367e23a82d4
                      OSBUILD_CA_CERT=LS0tLS1CRUdJTiBDRVJUSUZJQ0FURS0tLS0tCk1JSUREVENDQWZXZ0F3SUJBZ0lVUDNQM2YzNVBGUk51b2Z0emM5TDk2RGhUb2RBd0RRWUpLb1pJaHZjTkFRRUwKQlFBd0ZqRVVNQklHQTFVRUF3d0xiM05pZFdsc1pDNXZjbWN3SGhjTk1qQXdPVEV6TVRZeU1EVTNXaGNOTXpBdwpPVEV4TVRZeU1EVTNXakFXTVJRd0VnWURWUVFEREF0dmMySjFhV3hrTG05eVp6Q0NBU0l3RFFZSktvWklodmNOCkFRRUJCUUFEZ2dFUEFEQ0NBUW9DZ2dFQkFNQnBrWVFYSVNMYzhLWWpNUVlnenBROUNBM1JLMmdIRDBxYXFzdjgKYVJjVkM2NlM5ZkhxRUUxaUxVWE83MDJRejVza2poM3pxTHlHUjh3UlYvL2NJMWIxcjBVeVpTY0xaM1c3VVpyQwo0NDRmY3ozTXl4bFN6V1VZU1BnQklLaGdBOHFtclpSMW9mYWRyeHVSTCtzbkZESWt4M3crYzFKZVVuMmNsMFdpClV0WDJHR1ZDRldNT2FvZkRrWFVDRnVLSHdKUWdGTHRzSENaWWNmdldWSFpaNk44d0dwMlFaWTI5Yzh1bXBqMVAKUEZsWEM4ZGFaTE1hWFliRTBNSXRWMENISnB3R0lwYnlubVlUbCtzRnV2bDRvVG1yeHoveXh6cER2Vk1PckFJbQp4b2s3clVtVHVkRGVFU1JCT2dBMUt1YU1SVHVhSXBRbzJkb3ZxKzAxRmYzQU4yVUNBd0VBQWFOVE1GRXdIUVlEClZSME9CQllFRko3ZTZYM3kwZG9scS9KYlZpYklpd2RuU1ArNk1COEdBMVVkSXdRWU1CYUFGSjdlNlgzeTBkb2wKcS9KYlZpYklpd2RuU1ArNk1BOEdBMVVkRXdFQi93UUZNQU1CQWY4d0RRWUpLb1pJaHZjTkFRRUxCUUFEZ2dFQgpBRnp2N2llS0c5bFpLckIyTW1aaEFxSElMeWxhT3lWcTc3RzlCTVJURnNwWnU0MHI3R1R3Y0Rodmg1RUNvSFFiCmxrdTBYNU9YZ0R2WHNCcG9GSHJ2MEtPSWxTN1VKMXYwNGsvSllnWHcrbGpUVHMvOXpwbjhSVmxtcHUvR01PTTUKUWJHUCtOajVaczVmR0ZXaE43TTI1UWtVODJKbHhlSkFsUXhIQ2xDUGV4UkNNYTF5NXA3VG5nODBLSld0eVBQOQp0U2dNQnA3NVVSZW80NUU4UEpySnAzaHlvNFJ4OVJRR2tyeWNSSXdmQkh2a3hNSmZuc2M3WS92NWl1RjhteE16CjN0Yko5K0p5RUF1SHoxYkd1cUNYK3FKUVRUdC9RbzYydkdXYUk5U1ZLYlM4YVhMQzJONnFjaWJxcjU4ZjRESkQKSnNsTS83cHN5cjFvNXR0YkJuNlk1QXM9Ci0tLS0tRU5EIENFUlRJRklDQVRFLS0tLS0K
                      COMPOSER_HOST=aws.composer.osbuild.org
                      COMPOSER_ADDRESS=10.30.18.11
                      WORKER_SSL_KEYS_ARN=arn:aws:secretsmanager:us-east-1:933752197999:secret:brew_keys-7FUeel
                      SUBSCRIPTION_MANAGER_COMMAND_ARN=arn:aws:secretsmanager:us-east-1:933752197999:secret:subscription-manager-command-kQYlo9
                      SYSTEM_HOSTNAME_PREFIX=staging-internal-worker
                      COMPOSER_DIR=/etc/osbuild-composer
                      SECRETS_MANAGER_ENDPOINT_URL=https://vpce-0d13154306549b1cd-9zxr7z5v.secretsmanager.us-east-1.vpce.amazonaws.com/
                  - path: /etc/osbuild-composer/osbuild-composer.toml
                    content: |
                      [koji]
                      allowed_domains = [ "team.osbuild.org", "hub.brew.osbuild.org", "worker.brew.osbuild.org" ]
                      ca = "/etc/osbuild-composer/ca-crt.pem"
                
                      [worker]
                      allowed_domains = [ "team.osbuild.org", "worker.brew.osbuild.org" ]
                      ca = "/etc/osbuild-composer/ca-crt.pem"
            EOT -> (known after apply)
            # (2 unchanged attributes hidden)
        }
      ~ part {
            # (2 unchanged attributes hidden)
        }
      ~ part {
            # (2 unchanged attributes hidden)
        }
      ~ part {
            # (2 unchanged attributes hidden)
        }
      ~ part {
            # (2 unchanged attributes hidden)
        }
      ~ part {
            # (2 unchanged attributes hidden)
        }
    }

  # data.template_file.external_workers_cloud_config will be read during apply
  # (config refers to values not yet known)
 <= data "template_file" "external_workers_cloud_config"  {
      ~ id       = "b7e5442e08c472edc1a6addcda08b0f2daa4df64911905b6b67db4e6e2370c6d" -> (known after apply)
      ~ rendered = <<-EOT
            #cloud-config
            
            users:
              - name: ec2-user
                ssh_authorized_keys:
                  - "ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAACAQCxjfFIIlGfCn9iclHymWrEBrTU2lL6tkSGT1ep7dCPzw1jY6WnhQlPXMpePriNxNXlG8cWO9/RFpBd0z9FwNy+kfgh9fuyNY49I+Ma6OyTVBg5hNoFxfRXG5iHtc/SQlnbEFiKpSk4lipo4QZtBtmgAqgkSA6Dzhygb6u5M9ixTIx4WBjuSM0GXQzNjpefyiWu+sIR+h2UrQkKABuuIYQbrjl+FhVmaLvrvyTO2usOtvnYBjhbPwyO72WPjapKd/9hTaqPE1wFy6UF2nXc4Pgw0giQb6sibFTz7NTexW35Q98qpQOWMYKcpgZrlSaHHKZSMhtzO7MdZrOLFUXoS1AeAy4ghtcNrOBTlb5SvP73zz0qBRF2cCO4O0wp5wwqPhvw2ntb3pTLPtdetJ+V50QPnpnXySSnZp2zFwce21bXx67nh9lnhLrZgje7coQnPAFx/cl36ESJygiuPcBw+k18YulYMXUqaBtkwJLkRjDpjTX2e5MJ16oD7sJHc4/W5kyfLvdMsVhdq1CXHGVVOpzogb095VYi0RXFpnZR/1eVgC/R+WVytYfY80rfVOcdAo2GZfnJ5zYRUXJJ9MZkanxx3E7UOikEJN9sUj200z6Cyy0IfIqTbJ1B5f7fd3acRrL4DcYUdFI/1ByNW6F1j7cZiAGOJKNbzXF0T3tf8x0e1Q== major@redhat.com"
                  - "ssh-ed25519 AAAAC3NzaC1lZDI1NTE5AAAAIPB1jFl4p6FTBixHT6wOk6X8nj/Z7eoPNQE/M0wK485K obudai@redhat.com"
            
            write_files:
              - path: /tmp/cloud_init_vars
                content: |
                  OSBUILD_COMMIT=83caf800e52524b414f7f5bf5ae0d3c912c89192
                  COMPOSER_COMMIT=9b2d565545752338741b3e2aeaf87367e23a82d4
                  OSBUILD_CA_CERT=LS0tLS1CRUdJTiBDRVJUSUZJQ0FURS0tLS0tCk1JSUREVENDQWZXZ0F3SUJBZ0lVUDNQM2YzNVBGUk51b2Z0emM5TDk2RGhUb2RBd0RRWUpLb1pJaHZjTkFRRUwKQlFBd0ZqRVVNQklHQTFVRUF3d0xiM05pZFdsc1pDNXZjbWN3SGhjTk1qQXdPVEV6TVRZeU1EVTNXaGNOTXpBdwpPVEV4TVRZeU1EVTNXakFXTVJRd0VnWURWUVFEREF0dmMySjFhV3hrTG05eVp6Q0NBU0l3RFFZSktvWklodmNOCkFRRUJCUUFEZ2dFUEFEQ0NBUW9DZ2dFQkFNQnBrWVFYSVNMYzhLWWpNUVlnenBROUNBM1JLMmdIRDBxYXFzdjgKYVJjVkM2NlM5ZkhxRUUxaUxVWE83MDJRejVza2poM3pxTHlHUjh3UlYvL2NJMWIxcjBVeVpTY0xaM1c3VVpyQwo0NDRmY3ozTXl4bFN6V1VZU1BnQklLaGdBOHFtclpSMW9mYWRyeHVSTCtzbkZESWt4M3crYzFKZVVuMmNsMFdpClV0WDJHR1ZDRldNT2FvZkRrWFVDRnVLSHdKUWdGTHRzSENaWWNmdldWSFpaNk44d0dwMlFaWTI5Yzh1bXBqMVAKUEZsWEM4ZGFaTE1hWFliRTBNSXRWMENISnB3R0lwYnlubVlUbCtzRnV2bDRvVG1yeHoveXh6cER2Vk1PckFJbQp4b2s3clVtVHVkRGVFU1JCT2dBMUt1YU1SVHVhSXBRbzJkb3ZxKzAxRmYzQU4yVUNBd0VBQWFOVE1GRXdIUVlEClZSME9CQllFRko3ZTZYM3kwZG9scS9KYlZpYklpd2RuU1ArNk1COEdBMVVkSXdRWU1CYUFGSjdlNlgzeTBkb2wKcS9KYlZpYklpd2RuU1ArNk1BOEdBMVVkRXdFQi93UUZNQU1CQWY4d0RRWUpLb1pJaHZjTkFRRUxCUUFEZ2dFQgpBRnp2N2llS0c5bFpLckIyTW1aaEFxSElMeWxhT3lWcTc3RzlCTVJURnNwWnU0MHI3R1R3Y0Rodmg1RUNvSFFiCmxrdTBYNU9YZ0R2WHNCcG9GSHJ2MEtPSWxTN1VKMXYwNGsvSllnWHcrbGpUVHMvOXpwbjhSVmxtcHUvR01PTTUKUWJHUCtOajVaczVmR0ZXaE43TTI1UWtVODJKbHhlSkFsUXhIQ2xDUGV4UkNNYTF5NXA3VG5nODBLSld0eVBQOQp0U2dNQnA3NVVSZW80NUU4UEpySnAzaHlvNFJ4OVJRR2tyeWNSSXdmQkh2a3hNSmZuc2M3WS92NWl1RjhteE16CjN0Yko5K0p5RUF1SHoxYkd1cUNYK3FKUVRUdC9RbzYydkdXYUk5U1ZLYlM4YVhMQzJONnFjaWJxcjU4ZjRESkQKSnNsTS83cHN5cjFvNXR0YkJuNlk1QXM9Ci0tLS0tRU5EIENFUlRJRklDQVRFLS0tLS0K
                  COMPOSER_HOST=aws.composer.osbuild.org
                  COMPOSER_ADDRESS=172.31.64.11
                  WORKER_SSL_KEYS_ARN=arn:aws:secretsmanager:us-east-1:933752197999:secret:brew_keys-7FUeel
                  SUBSCRIPTION_MANAGER_COMMAND_ARN=arn:aws:secretsmanager:us-east-1:933752197999:secret:subscription-manager-command-kQYlo9
                  SYSTEM_HOSTNAME_PREFIX=staging-external-worker
                  COMPOSER_DIR=/etc/osbuild-composer
                  SECRETS_MANAGER_ENDPOINT_URL=https://secretsmanager.us-east-1.amazonaws.com/
              - path: /etc/osbuild-composer/osbuild-composer.toml
                content: |
                  [koji]
                  allowed_domains = [ "team.osbuild.org", "hub.brew.osbuild.org", "worker.brew.osbuild.org" ]
                  ca = "/etc/osbuild-composer/ca-crt.pem"
            
                  [worker]
                  allowed_domains = [ "team.osbuild.org", "worker.brew.osbuild.org" ]
                  ca = "/etc/osbuild-composer/ca-crt.pem"
        EOT -> (known after apply)
      ~ vars     = {
          ~ "composer_address"                = "172.31.64.11" -> (known after apply)
          ~ "composer_commit"                 = "9b2d565545752338741b3e2aeaf87367e23a82d4" -> "7f5e36dd948150fac4b03636c6d39bb76e2e81df"
            # (7 unchanged elements hidden)
        }
        # (1 unchanged attribute hidden)
    }

  # data.template_file.internal_workers_cloud_config will be read during apply
  # (config refers to values not yet known)
 <= data "template_file" "internal_workers_cloud_config"  {
      ~ id       = "12089650885755b603bdd3a2cf696044aa71d072d1b9a25867e5dd2cf81b79e4" -> (known after apply)
      ~ rendered = <<-EOT
            #cloud-config
            
            users:
              - name: ec2-user
                ssh_authorized_keys:
                  - "ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAACAQCxjfFIIlGfCn9iclHymWrEBrTU2lL6tkSGT1ep7dCPzw1jY6WnhQlPXMpePriNxNXlG8cWO9/RFpBd0z9FwNy+kfgh9fuyNY49I+Ma6OyTVBg5hNoFxfRXG5iHtc/SQlnbEFiKpSk4lipo4QZtBtmgAqgkSA6Dzhygb6u5M9ixTIx4WBjuSM0GXQzNjpefyiWu+sIR+h2UrQkKABuuIYQbrjl+FhVmaLvrvyTO2usOtvnYBjhbPwyO72WPjapKd/9hTaqPE1wFy6UF2nXc4Pgw0giQb6sibFTz7NTexW35Q98qpQOWMYKcpgZrlSaHHKZSMhtzO7MdZrOLFUXoS1AeAy4ghtcNrOBTlb5SvP73zz0qBRF2cCO4O0wp5wwqPhvw2ntb3pTLPtdetJ+V50QPnpnXySSnZp2zFwce21bXx67nh9lnhLrZgje7coQnPAFx/cl36ESJygiuPcBw+k18YulYMXUqaBtkwJLkRjDpjTX2e5MJ16oD7sJHc4/W5kyfLvdMsVhdq1CXHGVVOpzogb095VYi0RXFpnZR/1eVgC/R+WVytYfY80rfVOcdAo2GZfnJ5zYRUXJJ9MZkanxx3E7UOikEJN9sUj200z6Cyy0IfIqTbJ1B5f7fd3acRrL4DcYUdFI/1ByNW6F1j7cZiAGOJKNbzXF0T3tf8x0e1Q== major@redhat.com"
                  - "ssh-ed25519 AAAAC3NzaC1lZDI1NTE5AAAAIPB1jFl4p6FTBixHT6wOk6X8nj/Z7eoPNQE/M0wK485K obudai@redhat.com"
            
            write_files:
              - path: /tmp/cloud_init_vars
                content: |
                  OSBUILD_COMMIT=83caf800e52524b414f7f5bf5ae0d3c912c89192
                  COMPOSER_COMMIT=9b2d565545752338741b3e2aeaf87367e23a82d4
                  OSBUILD_CA_CERT=LS0tLS1CRUdJTiBDRVJUSUZJQ0FURS0tLS0tCk1JSUREVENDQWZXZ0F3SUJBZ0lVUDNQM2YzNVBGUk51b2Z0emM5TDk2RGhUb2RBd0RRWUpLb1pJaHZjTkFRRUwKQlFBd0ZqRVVNQklHQTFVRUF3d0xiM05pZFdsc1pDNXZjbWN3SGhjTk1qQXdPVEV6TVRZeU1EVTNXaGNOTXpBdwpPVEV4TVRZeU1EVTNXakFXTVJRd0VnWURWUVFEREF0dmMySjFhV3hrTG05eVp6Q0NBU0l3RFFZSktvWklodmNOCkFRRUJCUUFEZ2dFUEFEQ0NBUW9DZ2dFQkFNQnBrWVFYSVNMYzhLWWpNUVlnenBROUNBM1JLMmdIRDBxYXFzdjgKYVJjVkM2NlM5ZkhxRUUxaUxVWE83MDJRejVza2poM3pxTHlHUjh3UlYvL2NJMWIxcjBVeVpTY0xaM1c3VVpyQwo0NDRmY3ozTXl4bFN6V1VZU1BnQklLaGdBOHFtclpSMW9mYWRyeHVSTCtzbkZESWt4M3crYzFKZVVuMmNsMFdpClV0WDJHR1ZDRldNT2FvZkRrWFVDRnVLSHdKUWdGTHRzSENaWWNmdldWSFpaNk44d0dwMlFaWTI5Yzh1bXBqMVAKUEZsWEM4ZGFaTE1hWFliRTBNSXRWMENISnB3R0lwYnlubVlUbCtzRnV2bDRvVG1yeHoveXh6cER2Vk1PckFJbQp4b2s3clVtVHVkRGVFU1JCT2dBMUt1YU1SVHVhSXBRbzJkb3ZxKzAxRmYzQU4yVUNBd0VBQWFOVE1GRXdIUVlEClZSME9CQllFRko3ZTZYM3kwZG9scS9KYlZpYklpd2RuU1ArNk1COEdBMVVkSXdRWU1CYUFGSjdlNlgzeTBkb2wKcS9KYlZpYklpd2RuU1ArNk1BOEdBMVVkRXdFQi93UUZNQU1CQWY4d0RRWUpLb1pJaHZjTkFRRUxCUUFEZ2dFQgpBRnp2N2llS0c5bFpLckIyTW1aaEFxSElMeWxhT3lWcTc3RzlCTVJURnNwWnU0MHI3R1R3Y0Rodmg1RUNvSFFiCmxrdTBYNU9YZ0R2WHNCcG9GSHJ2MEtPSWxTN1VKMXYwNGsvSllnWHcrbGpUVHMvOXpwbjhSVmxtcHUvR01PTTUKUWJHUCtOajVaczVmR0ZXaE43TTI1UWtVODJKbHhlSkFsUXhIQ2xDUGV4UkNNYTF5NXA3VG5nODBLSld0eVBQOQp0U2dNQnA3NVVSZW80NUU4UEpySnAzaHlvNFJ4OVJRR2tyeWNSSXdmQkh2a3hNSmZuc2M3WS92NWl1RjhteE16CjN0Yko5K0p5RUF1SHoxYkd1cUNYK3FKUVRUdC9RbzYydkdXYUk5U1ZLYlM4YVhMQzJONnFjaWJxcjU4ZjRESkQKSnNsTS83cHN5cjFvNXR0YkJuNlk1QXM9Ci0tLS0tRU5EIENFUlRJRklDQVRFLS0tLS0K
                  COMPOSER_HOST=aws.composer.osbuild.org
                  COMPOSER_ADDRESS=10.30.18.11
                  WORKER_SSL_KEYS_ARN=arn:aws:secretsmanager:us-east-1:933752197999:secret:brew_keys-7FUeel
                  SUBSCRIPTION_MANAGER_COMMAND_ARN=arn:aws:secretsmanager:us-east-1:933752197999:secret:subscription-manager-command-kQYlo9
                  SYSTEM_HOSTNAME_PREFIX=staging-internal-worker
                  COMPOSER_DIR=/etc/osbuild-composer
                  SECRETS_MANAGER_ENDPOINT_URL=https://vpce-0d13154306549b1cd-9zxr7z5v.secretsmanager.us-east-1.vpce.amazonaws.com/
              - path: /etc/osbuild-composer/osbuild-composer.toml
                content: |
                  [koji]
                  allowed_domains = [ "team.osbuild.org", "hub.brew.osbuild.org", "worker.brew.osbuild.org" ]
                  ca = "/etc/osbuild-composer/ca-crt.pem"
            
                  [worker]
                  allowed_domains = [ "team.osbuild.org", "worker.brew.osbuild.org" ]
                  ca = "/etc/osbuild-composer/ca-crt.pem"
        EOT -> (known after apply)
      ~ vars     = {
          ~ "composer_address"                = "10.30.18.11" -> (known after apply)
          ~ "composer_commit"                 = "9b2d565545752338741b3e2aeaf87367e23a82d4" -> "7f5e36dd948150fac4b03636c6d39bb76e2e81df"
            # (7 unchanged elements hidden)
        }
        # (1 unchanged attribute hidden)
    }

  # aws_instance.composer_external must be replaced
-/+ resource "aws_instance" "composer_external" {
      ~ ami                          = "ami-0a8ee9c8284b8f3ff" -> "ami-07bb20d82c4e502f6" # forces replacement
      ~ arn                          = "arn:aws:ec2:us-east-1:933752197999:instance/i-0e5235dca9bc82294" -> (known after apply)
      ~ associate_public_ip_address  = true -> (known after apply)
      ~ availability_zone            = "us-east-1f" -> (known after apply)
      ~ cpu_core_count               = 1 -> (known after apply)
      ~ cpu_threads_per_core         = 2 -> (known after apply)
      - disable_api_termination      = false -> null
      - ebs_optimized                = false -> null
      - hibernation                  = false -> null
      + host_id                      = (known after apply)
      ~ id                           = "i-0e5235dca9bc82294" -> (known after apply)
      ~ instance_state               = "running" -> (known after apply)
      ~ ipv6_address_count           = 0 -> (known after apply)
      ~ ipv6_addresses               = [] -> (known after apply)
      + key_name                     = (known after apply)
      - monitoring                   = false -> null
      + outpost_arn                  = (known after apply)
      + password_data                = (known after apply)
      + placement_group              = (known after apply)
      ~ primary_network_interface_id = "eni-02f250427cdd85dc7" -> (known after apply)
      ~ private_dns                  = "ip-172-31-64-11.ec2.internal" -> (known after apply)
      ~ private_ip                   = "172.31.64.11" -> (known after apply)
      ~ public_dns                   = "ec2-34-234-177-181.compute-1.amazonaws.com" -> (known after apply)
      ~ public_ip                    = "34.234.177.181" -> (known after apply)
      ~ secondary_private_ips        = [] -> (known after apply)
      ~ security_groups              = [
          - "external_composer_staging",
        ] -> (known after apply)
      - source_dest_check            = true -> null
      ~ subnet_id                    = "subnet-0c016a02" -> (known after apply)
        tags                         = {
            "AppCode"      = "IMGB-001"
            "Name"         = "🏗 External Composer (staging)"
            "ServiceOwner" = "Image Builder"
        }
      ~ tenancy                      = "default" -> (known after apply)
      ~ user_data_base64             = "H4sIAAAAAAAA/9S7aZOcSn4v/L4j5jtgzYmwHcfVzVKFVJqRw0UBtZLZJGRS4MehYOtiSRYBtcCZ892fSKql6dZ2PPfeF7YiiG6S/O+//5INWlZlF5fdxO7r+D1XnGiX1n7TPRTpNY7+wgXVqYz8pv/wxtgYmgIxUBfIfXPH7iYkbtq0Kt9zwj3/p7s/3U0mLzf96e4zbzVt66pNu3Gv33V+mBRx2f2Fe0ppXPpF/OFNWqbdffh0fPN3Krvxy/YpbiZaGVZRWh7fc2+DtHuxYVS5i6/dQ0irUzQJq/IpPf7pzkiL+Bvl/vxyz93dqY2b9v0dx004psF7Lg7FCVu84ziOa9vko3/qkqpJhzj6mMf9uJf9m3Bv2jaZNK3PLRaLhSKBwV8KfShq7FZdmAtlsVgsF+bymj3pmw1dPS3LeRrSdV84jaY0NhbpXu5ya2ULcf02Wj4OFyFzZadMTPp4MOr4sUnBFRzo6l3owPkD0msl4oe5fgH9r/nTMZk/nXrgTuebXw1fhr1NlOMsAZV+fUKH1Sxdd+GDZdIy0PR0V1v5lKZ1NTW9TumK4+LTMbcWsjok/TGQTzNjnl7tzXXqKNnJMvjVwRxAVsdPfeqcfm036NdExI2Z7xbK6bRxzaDJ6K96Qgp/f27OvQ3FUwu7c+kqWRI8Xnr4VnQeM7/eRQ/zxPY/PWrCRe9lrIvlIZw+Hi/8MTUDuU0D3R7eAju+OtLMnL/7VJvQMdxdWB+9hlr+er3zLCPpBvjWiLwG7nV8qCxhES/66THpQtBAxabBzDo/vpWGgf+kIF0Ml3AK+Us9u1w+PSbni1h2gVTb+8cuirvtr2TGm49lXR56yyq9Whz0SxiLQnC4ym/LZE7LZN94xyx+G1Zm+bjQrw8hlWTN2vbH9PQYKpdfc+Gde6KuccCffKXLL9t9jjK1zuyDGM+MrSBX6tt2uw6nD84s75/258hoSRJ9EpaH9YoQWA/VMeDnM+KmPDrodemhByEmx+UD+tUhfec+ue/45onAMFpU4sp7KrezwUX4sN3ODS/3y+tV0t5imObaFsxbnIk8P8jLvuc3T5tPdrAVlNnT26dI8kPU7Kdq6OJI3zwISg8cWReyt6GXLlZwuwPBcNB5W+qe3l35WDA/fOAKP6ua/2jiKPG7+7Aq3rzGexyJs5kwHzG/vGGeeupGALY2Y2ubR0XIdDqtZd1W0uvali8wlw/vyuzBextXj8DUHgz+spu+m+24KjhFfvpK2N2lSbv4I6sIz2lZ+13ynnvoivqW3h9Zjfh49pt21Cy8VYH33N+eFYWWgjd79eMSGsbG/vBOCv2ndzwfz8SZOA2mwvTp7dMseJr5MR9J4VwQw3dzYS4+Uy+h8QgtDX0mnwdiNJNns+ns7UyUpHdvp0IgxaIf+0/v3kry21iU/HdiNP1a+OLjUkP2h73Fd3tLWCIcbe1UURHZYgt7W5PXMRqf8d0yF7YWRhrRgGo63sHjdcnCW8XjKcEqMA3RHQBRVjifCYHo8XFhzGw1F9EqwYGIlIhHyMH1PhDqrb/2MjvXEcKXnUl1JeK9T4gQYOZ0bdo6QViXIv6aGvys9vSoDYVaBQcvCxwgWasks3Phk3mIHolGZJsgL8aCRmxw8FcA2odaiS41ezZ99SzXDzbZoognpYORg4muIU3no8LorUxPiJQ09oqfxaSWTR4omKcS0nXPyruzk9MqKgBcjjpvlxjrmidGOtZ0bdzrzFV2b+Y6MEulcYjuWgQY7pDsHacGmNAyLhUEMVAMYbs3imiDVOXqHvQhyo47l2wzkhsioMbMy5Mrwvjq4ytxtHeSoW5RnJHBF+vKkOqrvaZrnCUSpu55L4Kt4WyuYaaQmNS2y199QwglQurevFQ8UFHhStVgH+g00IFMBOJhQSnNnO79VaTAtd6FtLYMZ164DurjNbHsZTcEuadZTjc1pLBxB33nEXIyCtAaelQvKeEddbtGgqciGgFb1M9ejhpHJyoqyd5aRzvsRCt7jQZLA77jgCKikWPptQ/y6TTio4tBdd+xNzN3SITgoHwyyGKHNa91NGPqrXTf1oTE0WmKbAVYB+QYGthYpSIhnl7ckp4CQnGw7AZUEjFQ0ZmshD5eV+f4kMihhkSSC49hrm8Ds54GYiuFlHRkTXK0IjoWtktbjBQDd4KLBYusSWIdFBQM2zyQvOtuWFxR4Q4mnvYEAyXiiWI6OiSasEKHaIMJ1ZbUswxtvjQp1VFeSZ7tuYaUX7zVvA2t+c6lXu3mtI5EdMLCogG5sIRapBiE5NYhQg4Wli7WV1YWUUCPQ2wreSBedj+gVT7TokOkm+lcwtgDJhaWpuNOv59X1y8YNY+1gspaBCKlFh/OAr3eh/mmtx3B9zX9amnUiJ1rYkvUCe1QQgNd2mSLUQkuTol5Y72RkIAkl0dVVBwFhMHZ0vV0WVybyFZcgOeuxyPRWYNluJqvrPVWNLTu0XKuNhDIzji4F7BqzxalpbMOm2BVY7I2zvBQX4IssUhx7cI1PiNeeLRtvMPOdo2XHfQz4ocDKRDvHXxtKtn2RsBOR6C63QXrhFq53uJDsjHFq4pXZIpzAFxbn4HDQiKrWQlVZW/RiI+JYkKz5rEYAbNcSIAQy3Pe8QDjKdbq3ioXg7+mZ6Bvp5BsERK7PnaAZR2iwswT0ZcSYBXeKRQNybHmInCogLKkizVBXmaAd/NqtuPrGcK6YK2rq5tHQoiBu5P0HSYIR8s5Cga3j/Lo4OJ8hgVv71Jj6pLEMIctBKWe+c72GmZ46mVIs3JzZ5Wgta13UrgGszDTz+CAeDffngDNBfNgzJfprSYjPNM2GtAxRVuUU9UkSL/Vcn73Tadghd4USR+taOE7IIlWWF6mi+NmqWjuASXwWB03y8Xt0j0alqAOxKm8UY3jTlWmRprvvjxfKrZ32NaucznaJencgvSv6G+XaKjVFNrV1B2qizHUFNh1AYY6B0PFQ7XO3aG6GkMleGo1uHZ1cbNqBsb7OvfsOvHs6gqy6grtOgWv9AO1J86SaE16z1KUYBWdw4Ly/oqXN2tQufZGADSqo1ViYV7XgwL08UHhfWd+utl8u6wDGCKH9DBVVDsTzqG4FXznmu+Lee9dXvkjCVY09w9o9pJ+vLTZOVoqS8/xzmGB5Y1WJ0G6uBrsUqse2FUPl4veUDfXjRYBsvjaTwoMJPNoOh7vHTZHmCo715keDXvBLtnIsGxkx6ORLQbDUtY2MV/FIXK2nzwH8DBVaODodaDpubfe0lAy5oEE0sihrbcifcgrveegyj2YJ1ecdy/twBJJ/YJk0VIxI2fb+o5xtEQy22j05BXv5G9s1hXBLa612yt775AfTedaBtKW+buDqdKH4o99/kJ3C/PaEa9JGqxotscdje3quFM3F6Aej25B+Z35DabGy3bmeeRchXCodt97/nxdDLUuQFbnnlpnLBbQrhNgs8ZYzaBaCUZW8SCr2CGCQrvOjKxiMRuM7Gd8FQoyxreajfHNKt5T68KzK8mwq8EdKtHN6hTY1cAw79mMfyW4dp159k/1nXlMr5FPnbp21btDJbFcMbJKZPSGWl2Z3s+8WG5dRr1/zrf31EoEQyUZap0xvh7zwVCnbA2odeEyvzA7srow1Ip3s0o07Er4OV+lcO1RH9FTxzxlvughk5FVA9PPG/3D9KtTpqdrj3nOe+pP9WW8eMOuC2NgzbUujKzOmZ5sDahV72asNrAaUc1cu6Yszqye/EHcEndgPKoB2kznunCHsTaJQB39S92smhrDaIfk2reYetno55/py4/1aWB4qqkxVFePxeeGuQvT28sqAd782hv2WBMEz64u4Of4lRg23WG06wJVxrsu3GzE2fWZx8ywWWzrhOGG4cxjeP4pX4UaaiU+58LUU+sEqDUFQzX1br6ZeRnDX03dYeQlGgzPGbPr53641fCaMr2ZH1m8vVt+Mf2m4LnOA7USQFZNmQ0gG/3/M74jZozRF9WV+cPL6sQY5Ywx5JntLsMMW2d77erCcukP+I7+Yv6EKsPnaJ9k3HLwwuID1WrKsGyMz0Y8DECtE/fnceM9m+Vo1RsZy4URG1OosvtR1uhryHDNYsr8wvIuq65/ELcCjjhltatO3YHhvhpYDWI4HnE3YuOW42POMLyxvPh5Hqfglvf9qIt6ix/Iqoth14kx1rY6Z7noZmPPvrD8MNQ/qg+LAapjjZyyPHBZvVJvMwBUWRxHHF9GvNmVAG/9n9WoxPtpHi9Y/UvB5fu9AR2SSyDOaFCa8kZ1BWAb0mZ5vMSqdjHUxfVVT9GPgqFS0egVGq8RDcaZZzZ8O8soLrAXsygzjmahD6w/muL8FEqodx16itaGvFmB3j+g2hX19gf9TjXtemXiq42+6Wt/5/+iF4+91XKYXqj2CkrDrDp+n/dCBGqtoLEe1ytk1xqy66Vh1xrDHFJrnfUNtm7a9RLeetOS4QcwnexKRFmto6xWDLtW0c/sPxDeX82ZrbON1tHYUrbeipxucyWbpRbfj92qo7FDc5hRHeZIhzmewSzSYO72MDevMEcKzDYCzPXluJaRJcywCLONCHNjCrNkCbOFBDNXgpk5hbm3gvlW+YGvNf+wha4jUJjOfz7bvbhCkfS+o7cwAyuYhQPMmaxoBbNIhxlawUwTYKYNMPN0mGtXmHvLcd+41+xh7mkwx1OYMX3xcNtjXpY/8ec4Z+lkcJ2IwlTJxjnWAUnwzZz4jO8VLf0DSoKlYvtOdHIPSAgL3D7Hgs1ddbhKaFgILAe+iYWj4gs8uMNGI9NoRU7eiuTPtCQU9dKzf4QxBdu6cSQiSTc6oGHp0TBVlOiAKs+Z8bczBT0HP7H1BbaVYI1oWMwYjehZynOsfoAdDUE81FkgCpdAAjRMZ6/j2V+OSJvZsAQ88+O+AOfgoJxZPPfFfHBLUgcr8xRI23K/VDSbGrJ7iIaf7Xs+G7308ddz7uCvtB7Y3sE/oApToCBnloUlvXzrByWBY65VM4OdhbKxj2XjbHOb4ViPYH3w+nmOZHWXzQusT49zjz3OlK/844qGDFcb2cs0GQwLGYhY9uyF7Dma7BVYBquNbNi5bGS57Kma7NpY9lRXdgtNNtSj7K2wDG3z9Xy/IhRmR4bfHhbbBBZeBjOlgNlxBrMFy8scZvnltocUsNjmMHOnsCAJLHAPM7Y//Oo8qLAeNGO9YzzrsfmQ9S1mk8pmpXGWGfs3mxPBbXaYeaxfqFXvsXk0G+ebV/ZDx5C9zJSBbcjuYMqufRx9YRSu7DlYNgZmJ5ZdEcuQ3duaDFUsG2oou0M4rnnZ4rX96oKHWZLDwuBhoRewMHmYaSIszCnMNgPMlBwWmIeFe4XZZgqzUITZcYCZxsPMFUe6zLx+1UNmbPb01PHcy+aHYTz/2uM9mztZT8/A2LPr5Na/K5Gdjd2sunjsrDHUKfxqnjFsLIPMlaFtyID5YbSR2cXibspg2MiuyGzeyMAOZaAyrBxl13Zld/Qbs9/9Kv56Bgs9hZk7G2tYls9gti1ggS+w0C4wc3mYbZitA8yOAiy0Hmb4CjNUwGwxHZ8XmvB1/IFap8ZtTr2OszK7z1jvH/0gGbe/BfDGcw6wGY/5a8SFOs6VbK55jX87lI1hIRvMPhHLhmPKBsP2ip2ZQ9nNXNkrtNEPBssV1RzxDgaGm1wGBcPI5qv4H0WYRRnM9BQWiMIs5GGmU1gYA8yMC8xACgtXvPWBsIfZpocZw8xGgJmSwYzSkfZ1/Nk5huVxZgzjPCSMeLDHnJ+Coc6fz6PCeD5lOcDsHup0nO/HNTazv7af5bhXuDJYmbKnmjJQjdE2g+VBgWU328hGwda1MfasXnjqYsQHsDeyZ38v/0ECs3B2w/Ti8vmPTWZO1haeHk2eWESjKwsDhWh4fLY3a2BhqsVOrZq83ltipEQ8XZpOtCWEbgMsKDvhOBi28snl8dVQPRU4KDckjSd8lDqHSMOE7ixx7ltOIrr8TMGYGMt8i8xDtPJzQmy83SJeuxJMlEiKDDcD0HfQIVgD3xyI6IpCFvFJ5fIz4OdEsgnSYyxg80Ah0XKeiOOLAxkdwh17FvEvn9VKgAUbH6KtJ3ylh9MtUZE4L18UODTZxVTfWMXVR2JSeZoh+EeGZ0XyxEj3saAYWqRiSV9jnqYGjxDCWwUTopg22po5ksxDVHo82ZvOfGvmOkLqZnB5/RLqxHYIaRx7I7o8RctcENxs25hCDffiTIcrTSKHSvJpncTloncKkAYSyA2tvkb8tnIP9dnnawkP+snlhXNENpKnLpqQ1CbUCO/rpAiEfOfSrRfgDoR99wmL22XkgDOgyHLyzdQYoplBlI2htSIQSRdhkzfWuhxr84MxJJ+QsL2CDIHAISKw5jVx+IEcCPDMWnZ5Xd8PemVr1CYFWRpCPjVW0Sc/bQdEPDfUvFNIEt/Lp41ZKhfH3jbANnngTKWwBNDI295adWdbJZ/sg27GhX5ZFokW8MQJBO/g5OhiCsoyLrxz5GymWEh4U5wThGetpdeph6+N54Cdz89V6wCm1trljfVWB46+DSU8+BjsgIr5oAx3QKdpjN2zv9Y7e12XNgYzpB0HS+u2kU5LY7VNI556ZCVAj4/KvYQgGIDilBEhK4o8Xr9aNik8EWTYESgRdD661L1x0AbTiYCZ6woS69LLEskTPSnikTK+fMoUbBJ9s+e3inWIFKTpuVlEkOQJAhpZeYJOnLzlHWvOg/J4CTJwXtKED20CAK9ddyJ/jop5BtcRwYRqhG4ufr7VAymyLayToDSlcOUVtr7pfRL1cHXlCV8PPr4ujQJt90N09bXoikm+s/HWizVPMwlYevzMMXMd2Njo4aH2Aupd3DxCkbMZrGJW+rp2dvt5vhe9BuqebmRetRsAjDNFNMT5I8rnlaEhxb7UIy9L16ZmrhdQI0sTC6pZ6ErEE+nZB62Z61LEg9LBdB8JdGlSnViaLqFD5Hy2C+dbHawjbGFKljTv4QFlaKCyQ5Mt08suaE7E6+DkhhAVoPMwWAf59OKQKA+0a2eXXupoW9Edtk6Mr923dk13nphU/soc7APxjIzyLh/OYlq71oF89yXk1y8GTaLrtrZFJkYsp5cm7krDrJuIp1lcerpVmj12SEY0U7JEfWMcUBbjy9TRNg3Q5v1OAFNfWlxckhwiJ/rkOddHkFMSlpspUlFjColv8tQFg35eZp5glSCLtChDOhog7nqizVyf7y7xml49lajQoXm4ri7ETuxgSOy9RAAmyWNQJGuUb6aeg6cmATDW2jPBHu+J1Q6tCI61buNitELiVsekliEB+2gwe1+s+wALKZH02irqQ9R3OMJbJ3DaHhdkBQ6AuBK4moJ7sVV0CenWgQd9Fh7rhORz3152qifUKi7qysW1RdZR5UtKjqX6iguEQmkhuQ6Y2rm+CdKOJ6tOsdf06kqREmQot8SQD0okhmtqWgSQZWGcgzUBgVBN0ZALhpYM9iF63AsUuyLdIlyj2CFrY/CqaEBLt593mD/2KK8dXAAHrcGB5F7iZeGZrJCFVmDqp+0uFPOrSfUhpnpn4GsbaMIFOJFk2vzu+SW5bufmD3pg9eHrly6Wtf+401zr4wKBD35Tvvcv7fs2Dpu4awu/9I9x8/7UTmK/7SbC+7kkvZ2JwvztfD5/3vU+vnZxU/r0Y1gVddXGzfh5z+Q40/ij/SzOwoq1RJtHewPBR2MBFqvnLwMWQP0/l9yegjZs0rpLq3LyTDIJq6Lwy2iSmy6t5p/lu5atGR/X0LLBwtA+PiJN3xw+tJ1/TMvj5LMJk88mfO0ldYM+PMRd+FC1wSml0dcbLW2JNNv6YpoG1Ee4AfZHjPYfkq6r2/cPD69tu/9i271f+ENV+pf2PqyKh5cfa3xP5DcL911V0O9/w/GfeZWl//V841NaXeLoY1QVflq23AfuP7k3XewX988c76vm+ObfuDfJKbgPmvjy9fqlavK4+fYR91lC6HMfuDff1zr0J2HT3ddx8ebus3Y3hv+wfv/P9PjxJ3b/yMdy10mbxJTeoPijr+X+6SFIy4fAb5O7Nu64SXyquDqt4yc/pXdtdWrC+Pvf5tz9mVvFHdclMZeWbeeXYcxt1Pu7DbDsBVhqHzfqh1/+JTw1lJvsW46B7f3DgyDP78XZ9P755wP1u7jtHoq48yeR3/kPn3lN0uhfmYxF28ZFQGMuqdqu9Iv4/k7H+/2XlPnw5pffvp9Fv09++e2FMr/fPwP5hs2X8WFyHpu07LjqdLOojC8vBMZhUnFvrLjr0vLItX3bxcWXx1xXcb/89kqn3+9Hltaze74iuL/7/FvYUa6Nu8kXVr+8YvO/AwbPzrmVvIA56AscuopDa3BzBoqPadvFzWvAXNIuGffcPZza5oFWoU9HTfxLy72uS9wx7ia3pcnZp6eY+/9YRfq8lEbcL7/9UTn/nfsbl33iJg335t4a6ayuScvjG+7fb9a9rNwfnwV/fK7c91lblXefyX+2881/kxn3N270eFNwk6f/rgJ33+suz1/bcpOJf+qq/03AUeOaVj2DDevOnF9GXBg3XfqUhqw03MBz2zRC5zlvueXi5b77u8BvY3nKTSJuwv31r3/lfvntq0/1fuf+nfvlt5ed8/cXNfcrKZ/LxB/JePWNyHclPDP6Izl53P9f5EBcRnWVlt2EVdtffvtZ1//9O2nz3aHrD3Pl1Vj1OjlePnrzo9039H9x6E98x5zDfPciT74j/H8K6O80xfpo2RAtVtqHhyg+P5TnIhZK4c6yF7Z2m9nOfvNA0+Dbue2rZnOq/46Rtqsa/xj/vbmc6s9rXFV+2Xd/lz5x/8Qdm7hmWPgs83fuoW6q8KGoTmXX/oXBr7zjuD9zWtmempjTFItLW+7pRGnPBrYyDrs44p7Spu3u7zjuqWo4e2NoiEtL7jf+/l7i+d//wkXVONukT1zb+R33ywvjv8hg/4Im9vPx96f09uk9jeOaE+44LqrK+G5UZZnEYc54HXRr/E8Dz60zbTmfNrEf9VzhRzFTZ7Tx+tR+TMun6kdii/ypvb8+ta+e340qjPIMP/9SUSYv/Ox3MRelTRx2VdMzUUXatml5ZIKLPEobbvLatzd2iyhiPW+c757azg/GcjY6nFHeIvvLby90+f11hJiqUfzkn2jXcjzHv+H+xnVxzE38F0yZDozla6NGBVDM4Ghp+7Q8XW9T97VrmewmZkiJw6rkJujMfcbfjYxh6YW367gZ7a3KkTRMqguj4j5+7an336x8xykkbtInVu3852noGbFpy12atPMDGt9xXFedwuQV9cN93VTnlKmRlsePIYMGM2SsAX+48Sn9H1MP/jvT0/eyPW7Oafi5Ay6i7NR2f3/aVRxl81TJMt/nyqqcsJEq8puIq6umu/k7bTkaty1H0zymPSMK4rs/c23ol2UcjeismyqIo/u7P3M2VOG/FInfR3H5r+85h03BbFMYMhYMQE0asqGjZTJvU3LHjjwcjc8x5fyOa6uC8R970b9xwanjLjFL73/uuMQ/x1zacU16TDqurC73d18yacT2DXzR889vCuPEr9P7tgrzuLuPHu5YVvzjZNU5bpo0iu/DqnxifWyszidKub/+ldOgfvef1rj1v+72o3Otron94sPru/m7t/Id23wTyYb4yI+Lqpw0Ma386HaaiGu/+ba2/DNzZFF1MXc7K36J8hiLm57t/QvOhd/mX7jcaP5DuH+merEvLlkicZNJWV2+7L+JeiZ79sIf0XzHcd9k0mTyp7v/PwAA///xvWnsUDYAAA==" -> "H4sIAAAAAAAA/9S7aZOcSn4v/L4j5jtgzYmwHcfVzVKFVJqRw0UBtZLZJGRS4MehYOtiSRYBtcCZ892fSKql6dZ2PPfeF7YiiG6S/O+//5INWlZlF5fdxO7r+D1XnGiX1n7TPRTpNY7+wgXVqYz8pv/wxtgYmgIxUBfIfXPH7iYkbtq0Kt9zwj3/p7s/3U0mLzf96e4zbzVt66pNu3Gv33V+mBRx2f2Fe0ppXPpF/OFNWqbdffh0fPN3Krvxy/YpbiZaGVZRWh7fc2+DtHuxYVS5i6/dQ0irUzQJq/IpPf7pzkiL+Bvl/vxyz93dqY2b9v0dx004psF7Lg7FCVu84ziOa9vko3/qkqpJhzj6mMf9uJf9m3Bv2jaZNK3PLRaLhSKBwV8KfShq7FZdmAtlsVgsF+bymj3pmw1dPS3LeRrSdV84jaY0NhbpXu5ya2ULcf02Wj4OFyFzZadMTPp4MOr4sUnBFRzo6l3owPkD0msl4oe5fgH9r/nTMZk/nXrgTuebXw1fhr1NlOMsAZV+fUKH1Sxdd+GDZdIy0PR0V1v5lKZ1NTW9TumK4+LTMbcWsjok/TGQTzNjnl7tzXXqKNnJMvjVwRxAVsdPfeqcfm036NdExI2Z7xbK6bRxzaDJ6K96Qgp/f27OvQ3FUwu7c+kqWRI8Xnr4VnQeM7/eRQ/zxPY/PWrCRe9lrIvlIZw+Hi/8MTUDuU0D3R7eAju+OtLMnL/7VJvQMdxdWB+9hlr+er3zLCPpBvjWiLwG7nV8qCxhES/66THpQtBAxabBzDo/vpWGgf+kIF0Ml3AK+Us9u1w+PSbni1h2gVTb+8cuirvtr2TGm49lXR56yyq9Whz0SxiLQnC4ym/LZE7LZN94xyx+G1Zm+bjQrw8hlWTN2vbH9PQYKpdfc+Gde6KuccCffKXLL9t9jjK1zuyDGM+MrSBX6tt2uw6nD84s75/258hoSRJ9EpaH9YoQWA/VMeDnM+KmPDrodemhByEmx+UD+tUhfec+ue/45onAMFpU4sp7KrezwUX4sN3ODS/3y+tV0t5imObaFsxbnIk8P8jLvuc3T5tPdrAVlNnT26dI8kPU7Kdq6OJI3zwISg8cWReyt6GXLlZwuwPBcNB5W+qe3l35WDA/fOAKP6ua/2jiKPG7+7Aq3rzGexyJs5kwHzG/vGGeeupGALY2Y2ubR0XIdDqtZd1W0uvali8wlw/vyuzBextXj8DUHgz+spu+m+24KjhFfvpK2N2lSbv4I6sIz2lZ+13ynnvoivqW3h9Zjfh49pt21Cy8VYH33N+eFYWWgjd79eMSGsbG/vBOCv2ndzwfz8SZOA2mwvTp7dMseJr5MR9J4VwQw3dzYS4+Uy+h8QgtDX0mf/s0iyU5iubTd8KMf/LDacBLsiSHciTNg+CtHIvxOyF6+lr44uNSQ/aHvcV3e0tYIhxt7VRREdliC3tbk9cxGp/x3TIXthZGGtGAajreweN1ycJbxeMpwSowDdEdAFFWOJ8JgejxcWHMbDUX0SrBgYiUiEfIwfU+EOqtv/YyO9cRwpedSXUl4r1PiBBg5nRt2jpBWJci/poa/Kz29KgNhVoFBy8LHCBZqySzc+GTeYgeiUZkmyAvxoJGbHDwVwDah1qJLjV7Nn31LNcPNtmiiCelg5GDia4hTeejwuitTE+IlDT2ip/FpJZNHiiYpxLSdc/Ku7OT0yoqAFyOOm+XGOuaJ0Y61nRt3OvMVXZv5jowS6VxiO5aBBjukOwdpwaY0DIuFQQxUAxhuzeKaINU5eoe9CHKjjuXbDOSGyKgxszLkyvC+OrjK3G0d5KhblGckcEX68qQ6qu9pmucJRKm7nkvgq3hbK5hppCY1LbLX31DCCVC6t68VDxQUeFK1WAf6DTQgUwE4mFBKc2c7v1VpMC13oW0tgxnXrgO6uM1sexlNwS5p1lONzWksHEHfecRcjIK0Bp6VC8p4R11u0aCpyIaAVvUz16OGkcnKirJ3lpHO+xEK3uNBksDvuOAIqKRY+m1D/LpNOKji0F137E3M3dIhOCgfDLIYoc1r3U0Y+qtdN/WhMTRaYpsBVgH5Bga2FilIiGeXtySngJCcbDsBlQSMVDRmayEPl5X5/iQyKGGRJILj2GubwOzngZiK4WUdGRNcrQiOha2S1uMFAN3gosFi6xJYh0UFAzbPJC8625YXFHhDiae9gQDJeKJYjo6JJqwQodogwnVltSzDG2+NCnVUV5Jnu25hpRfvNW8Da35zqVe7ea0jkR0wsKiAbmwhFqkGITk1iFCDhaWLtZXVhZRQI9DbCt5IF52P6BVPtOiQ6Sb6VzC2AMmFpam406/n1fXLxg1j7WCyloEIqUWH84Cvd6H+aa3HcH3Nf1qadSInWtiS9QJ7VBCA13aZItRCS5OiXljvZGQgCSXR1VUHAWEwdnS9XRZXJvIVlyA567HI9FZg2W4mq+s9VY0tO7Rcq42EMjOOLgXsGrPFqWlsw6bYFVjsjbO8FBfgiyxSHHtwjU+I154tG28w852jZcd9DPihwMpEO8dfG0q2fZGwE5HoLrdBeuEWrne4kOyMcWrildkinMAXFufgcNCIqtZCVVlb9GIj4liQrPmsRgBs1xIgBDLc97xAOMp1ureKheDv6ZnoG+nkGwRErs+doBlHaLCzBPRlxJgFd4pFA3JseYicKiAsqSLNUFeZoB382q24+sZwrpgraurm0dCiIG7k/QdJghHyzkKBreP8ujg4nyGBW/vUmPqksQwhy0EpZ75zvYaZnjqZUizcnNnlaC1rXdSuAazMNPP4IB4N9+eAM0F82DMl+mtJiM80zYa0DFFW5RT1SRIv9VyfvdNp2CF3hRJH61o4TsgiVZYXqaL42apaO4BJfBYHTfLxe3SPRqWoA7EqbxRjeNOVaZGmu++PF8qtnfY1q5zOdol6dyC9K/ob5doqNUU2tXUHaqLMdQU2HUBhjoHQ8VDtc7doboaQyV4ajW4dnVxs2oGxvs69+w68ezqCrLqCu06Ba/0A7UnzpJoTXrPUpRgFZ3DgvL+ipc3a1C59kYANKqjVWJhXteDAvTxQeF9Z3662Xy7rAMYIof0MFVUOxPOobgVfOea74t5711e+SMJVjT3D2j2kn68tNk5WipLz/HOYYHljVYnQbq4GuxSqx7YVQ+Xi95QN9eNFgGy+NpPCgwk82g6Hu8dNkeYKjvXmR4Ne8Eu2ciwbGTHo5EtBsNS1jYxX8UhcrafPAfwMFVo4Oh1oOm5t97SUDLmgQTSyKGttyJ9yCu956DKPZgnV5x3L+3AEkn9gmTRUjEjZ9v6jnG0RDLbaPTkFe/kb2zWFcEtrrXbK3vvkB9N51oG0pb5u4Op0ofij33+QncL89oRr0karGi2xx2N7eq4UzcXoB6PbkH5nfkNpsbLduZ55FyFcKh233v+fF0MtS5AVueeWmcsFtCuE2CzxljNoFoJRlbxIKvYIYJCu86MrGIxG4zsZ3wVCjLGt5qN8c0q3lPrwrMrybCrwR0q0c3qFNjVwDDv2Yx/Jbh2nXn2T/WdeUyvkU+dunbVu0MlsVwxskpk9IZaXZnez7xYbl1GvX/Ot/fUSgRDJRlqnTG+HvPBUKdsDah14TK/MDuyujDUinezSjTsSvg5X6Vw7VEf0VPHPGW+6CGTkVUD088b/cP0q1Omp2uPec576k/1Zbx4w64LY2DNtS6MrM6ZnmwNqFXvZqw2sBpRzVy7pizOrJ78QdwSd2A8qgHaTOe6cIexNolAHf1L3ayaGsNoh+Tat5h62ejnn+nLj/VpYHiqqTFUV4/F54a5C9PbyyoB3vzaG/ZYEwTPri7g5/iVGDbdYbTrAlXGuy7cbMTZ9ZnHzLBZbOuE4YbhzGN4/ilfhRpqJT7nwtRT6wSoNQVDNfVuvpl5GcNfTd1h5CUaDM8Zs+vnfrjV8JoyvZkfWby9W34x/abguc4DtRJAVk2ZDSAb/f8zviNmjNEX1ZX5w8vqxBjljDHkme0uwwxbZ3vt6sJy6Q/4jv5i/oQqw+don2TccvDC4gPVasqwbIzPRjwMQK0T9+dx4z2b5WjVGxnLhREbU6iy+1HW6GvIcM1iyvzC8i6rrn8QtwKOOGW1q07dgeG+GlgNYjgecTdi45bjY84wvLG8+Hkep+CW9/2oi3qLH8iqi2HXiTHWtjpnuehmY8++sPww1D+qD4sBqmONnLI8cFm9Um8zAFRZHEccX0a82ZUAb/2f1ajE+2keL1j9S8Hl+70BHZJLIM5oUJryRnUFYBvSZnm8xKp2MdTF9VVP0Y+CoVLR6BUarxENxplnNnw7yygusBezKDOOZqEPrD+a4vwUSqh3HXqK1oa8WYHeP6DaFfX2B/1ONe16ZeKrjb7pa3/n/6IXj73VcpheqPYKSsOsOn6f90IEaq2gsR7XK2TXGrLrpWHXGsMcUmud9Q22btr1Et5605LhBzCd7EpEWa2jrFYMu1bRz+w/EN5fzZmts43W0dhStt6KnG5zJZulFt+P3aqjsUNzmFEd5kiHOZ7BLNJg7vYwN68wRwrMNgLM9eW4lpElzLAIs40Ic2MKs2QJs4UEM1eCmTmFubeC+Vb5ga81/7CFriNQmM5/Ptu9uEKR9L6jtzADK5iFA8yZrGgFs0iHGVrBTBNgpg0w83SYa1eYe8tx37jX7GHuaTDHU5gxffFw22Nelj/x5zhn6WRwnYjCVMnGOdYBSfDNnPiM7xUt/QNKgqVi+050cg9ICAvcPseCzV11uEpoWAgsB76JhaPiCzy4w0Yj02hFTt6K5M+0JBT10rN/hDEF27pxJCJJNzqgYenRMFWU6IAqz5nxtzMFPQc/sfUFtpVgjWhYzBiN6FnKc6x+gB0NQTzUWSAKl0ACNExnr+PZX45Im9mwBDzz474A5+CgnFk898V8cEtSByvzFEjbcr9UNJsasnuIhp/tez4bvfTx13Pu4K+0HtjewT+gClOgIGeWhSW9fOsHJYFjrlUzg52FsrGPZeNsc5vhWI9gffD6eY5kdZfNC6xPj3OPPc6Ur/zjioYMVxvZyzQZDAsZiFj27IXsOZrsFVgGq41s2LlsZLnsqZrs2lj2VFd2C0021KPsrbAMbfP1fL8iFGZHht8eFtsEFl4GM6WA2XEGswXLyxxm+eW2hxSw2OYwc6ewIAkscA8ztj/86jyosB40Y71jPOux+ZD1LWaTymalcZYZ+zebE8Ftdph5rF+oVe+xeTQb55tX9kPHkL3MlIFtyO5gyq59HH1hFK7sOVg2BmYnll0Ry5Dd25oMVSwbaii7Qziuednitf3qgodZksPC4GGhF7AweZhpIizMKcw2A8yUHBaYh4V7hdlmCrNQhNlxgJnGw8wVR7rMvH7VQ2Zs9vTU8dzL5odhPP/a4z2bO1lPz8DYs+vk1r8rkZ2N3ay6eOysMdQp/GqeMWwsg8yVoW3IgPlhtJHZxeJuymDYyK7IbN7IwA5loDKsHGXXdmV39Buz3/0q/noGCz2FmTsba1iWz2C2LWCBL7DQLjBzeZhtmK0DzI4CLLQeZvgKM1TAbDEdnxea8HX8gVqnxm1OvY6zMrvPWO8f/SAZt78F8MZzDrAZj/lrxIU6zpVsrnmNfzuUjWEhG8w+EcuGY8oGw/aKnZlD2c1c2Su00Q8GyxXVHPEOBoabXAYFw8jmq/gfRZhFGcz0FBaIwizkYaZTWBgDzIwLzEAKC1e89YGwh9mmhxnDzEaAmZLBjNKR9nX82TmG5XFmDOM8JIx4sMecn4Khzp/Po8J4PmU5wOwe6nSc78c1NrO/tp/luFe4MliZsqeaMlCN0TaD5UGBZTfbyEbB1rUx9qxeeOpixAewN7Jnfy//QQKzcHbD9OLy+Y9NZk7WFp4eTZ5YRKMrCwOFaHh8tjdrYGGqxU6tmrzeW2KkRDxdmk60JYRuAywoO+E4GLbyyeXx1VA9FTgoNySNJ3yUOodIw4TuLHHuW04iuvxMwZgYy3yLzEO08nNCbLzdIl67EkyUSIoMNwPQd9AhWAPfHIjoikIW8Unl8jPg50SyCdJjLGDzQCHRcp6I44sDGR3CHXsW8S+f1UqABRsfoq0nfKWH0y1RkTgvXxQ4NNnFVN9YxdVHYlJ5miH4R4ZnRfLESPexoBhapGJJX2OepgaPEMJbBROimDbamjmSzENUejzZm858a+Y6QupmcHn9EurEdghpHHsjujxFy1wQ3GzbmEIN9+JMhytNIodK8mmdxOWidwqQBhLIDa2+Rvy2cg/12edrCQ/6yeWFc0Q2kqcumpDUJtQI7+ukCIR859KtF+AOhH33CYvbZeSAM6DIcvLN1BiimUGUjaG1IhBJF2GTN9a6HGvzgzEkn5CwvYIMgcAhIrDmNXH4gRwI8Mxadnld3w96ZWvUJgVZGkI+NVbRJz9tB0Q8N9S8U0gS38unjVkqF8feNsA2eeBMpbAE0Mjb3lp1Z1sln+yDbsaFflkWiRbwxAkE7+Dk6GIKyjIuvHPkbKZYSHhTnBOEZ62l16mHr43ngJ3Pz1XrAKbW2uWN9VYHjr4NJTz4GOyAivmgDHdAp2mM3bO/1jt7XZc2BjOkHQdL67aRTktjtU0jnnpkJUCPj8q9hCAYgOKUESErijxev1o2KTwRZNgRKBF0PrrUvXHQBtOJgJnrChLr0ssSyRM9KeKRMr58yhRsEn2z57eKdYgUpOm5WUSQ5AkCGll5gk6cvOUda86D8ngJMnBe0oQPbQIAr113In+OinkG1xHBhGqEbi5+vtUDKbItrJOgNKVw5RW2vul9EvVwdeUJXw8+vi6NAm33Q3T1teiKSb6z8daLNU8zCVh6/Mwxcx3Y2OjhofYC6l3cPEKRsxmsYlb6unZ2+3m+F70G6p5uZF61GwCMM0U0xPkjyueVoSHFvtQjL0vXpmauF1AjSxMLqlnoSsQT6dkHrZnrUsSD0sF0Hwl0aVKdWJouoUPkfLYL51sdrCNsYUqWNO/hAWVooLJDky3Tyy5oTsTr4OSGEBWg8zBYB/n04pAoD7RrZ5de6mhb0R22Toyv3bd2TXeemFT+yhzsA/GMjPIuH85iWrvWgXz3JeTXLwZNouu2tkUmRiynlybuSsOsm4inWVx6ulWaPXZIRjRTskR9YxxQFuPL1NE2DdDm/U4AU19aXFySHCIn+uQ510eQUxKWmylSUWMKiW/y1AWDfl5mnmCVIIu0KEM6GiDueqLNXJ/vLvGaXj2VqNChebiuLsRO7GBI7L1EACbJY1Aka5Rvpp6DpyYBMNbaM8Ee74nVDq0IjrVu42K0QuJWx6SWIQH7aDB7X6z7AAspkfTaKupD1Hc4wlsncNoeF2QFDoC4EriagnuxVXQJ6daBB30WHuuE5HPfXnaqJ9QqLurKxbVF1lHlS0qOpfqKC4RCaSG5Dpjaub4J0o4nq06x1/TqSpESZCi3xJAPSiSGa2paBJBlYZyDNQGBUE3RkAuGlgz2IXrcCxS7It0iXKPYIWtj8KpoQEu3n3eYP/Yorx1cAAetwYHkXuJl4ZmskIVWYOqn7S4U86tJ9SGmemfgaxtowgU4kWTa/O75Jblu5+YPemD14euXLpa1/7jTXOvjAoEPflO+9y/t+zYOm7hrC7/0j3Hz/tROYr/tJsL7uSS9nYnC/O18Pn/e9T6+dnFT+vRjWBV11cbN+HnP5DjT+KP9LM7CirVEm0d7A8FHYwEWq+cvAxZA/T+X3J6CNmzSukurcvJMMgmrovDLaJKbLq3mn+W7lq0ZH9fQssHC0D4+Ik3fHD60nX9My+PkswmTzyZ87SV1gz48xF34ULXBKaXR1xstbYk02/pimgbUR7gB9keM9h+Srqvb9w8Pr227/2LbvV/4Q1X6l/Y+rIqHlx9rfE/kNwv3XVXQ73/D8Z95laX/9XzjU1pd4uhjVBV+WrbcB+4/uTdd7Bf3zxzvq+b45t+4N8kpuA+a+PL1+qVq8rj59hH3WULocx+4N9/XOvQnYdPd13Hx5u6zdjeG/7B+/8/0+PEndv/Ix3LXSZvElN6g+KOv5f7pIUjLh8Bvk7s27rhJfKq4Oq3jJz+ld211asL4+9/m3P2ZW8Ud1yUxl5Zt55dhzG3U+7sNsOwFWGofN+qHX/4lPDWUm+xbjoHt/cODIM/vxdn0/vnnA/W7uO0eirjzJ5Hf+Q+feU3S6F+ZjEXbxkVAYy6p2q70i/j+Tsf7/ZeU+fDml9++n0W/T3757YUyv98/A/mGzZfxYXIem7TsuOp0s6iMLy8ExmFScW+suOvS8si1fdvFxZfHXFdxv/z2Sqff70eW1rN7viK4v/v8W9hRro27yRdWv7xi878DBs/OuZW8gDnoCxy6ikNrcHMGio9p28XNa8Bc0i4Z99w9nNrmgVahT0dN/EvLva5L3DHuJrelydmnp5j7/1hF+ryURtwvv/1ROf+d+xuXfeImDffm3hrprK5Jy+Mb7t9v1r2s3B+fBX98rtz3WVuVd5/Jf7bzzX+TGfc3bvR4U3CTp/+uAnff6y7PX9tyk4l/6qr/TcBR45pWPYMN686cX0ZcGDdd+pSGrDTcwHPbNELnOW+55eLlvvu7wG9jecpNIm7C/fWvf+V++e2rT/V+5/6d++W3l53z9xc19yspn8vEH8l49Y3IdyU8M/ojOXnc/1/kQFxGdZWW3YRV219++1nX//07afPdoesPc+XVWPU6OV4+evOj3Tf0f3HoT3zHnMN89yJPviP8fwro7zTF+mjZEC1W2oeHKD4/lOciFkrhzrIXtnab2c5+80DT4Nu57atmc6r/jpG2qxr/GP+9uZzqz2tcVX7Zd3+XPnH/xB2buGZY+Czzd+6hbqrwoahOZdf+hcGvvOO4P3Na2Z6amNMUi0tb7ulEac8GtjIOuzjintKm7e7vOO6pajh7Y2iIS0vuN/7+XuL53//CRdU426RPXNv5HffLC+O/yGD/gib28/H3p/T26T2N45oT7jguqsr4blRlmcRhzngddGv8TwPPrTNtOZ82sR/1XOFHMVNntPH61H5My6fqR2KL/Km9vz61r57fjSqM8gw//1JRJi/87HcxF6VNHHZV0zNRRdq2aXlkgos8Shtu8tq3N3aLKGI9b5zvntrOD8ZyNjqcUd4i+8tvL3T5/XWEmKpR/OSfaNdyPMe/4f7GdXHMTfwXTJkOjOVro0YFUMzgaGn7tDxdb1P3tWuZ7CZmSInDquQm6Mx9xt+NjGHphbfruBntrcqRNEyqC6PiPn7tqfffrHzHKSRu0idW7fznaegZsWnLXZq08wMa33FcV53C5BX1w33dVOeUqZGWx48hgwYzZKwBf7jxKf0fUw/+O9PT97I9bs5p+LkDLqLs1HZ/f9pVHGXzVMky3+fKqpywkSrym4irq6a7+TttORq3LUfTPKY9Iwriuz9zbeiXZRyN6KybKoij+7s/czZU4b8Uid9Hcfmv7zmHTcFsUxgyFgxATRqyoaNlMm9TcseOPByNzzHl/I5rq4LxH3vRv3HBqeMuMUvvf+64xD/HXNpxTXpMOq6sLvd3XzJpxPYNfNHzz28K48Sv0/u2CvO4u48e7lhW/ONk1TlumjSK78OqfGJ9bKzOJ0q5v/6V06B+95/WuPW/7vajc62uif3iw+u7+bu38h3bfBPJhvjIj4uqnDQxrfzodpqIa7/5trb8M3NkUXUxdzsrfonyGIubnu39C86F3+ZfuNxo/kO4f6Z6sS8uWSJxk0lZXb7sv4l6Jnv2wh/RfMdx32TSZPKnu/8/AAD//+EA2QpQNgAA" # forces replacement
      ~ vpc_security_group_ids       = [
          - "sg-0be4cfbfac3cc0022",
        ] -> (known after apply)
        # (3 unchanged attributes hidden)

      - credit_specification {
          - cpu_credits = "unlimited" -> null
        }

      + ebs_block_device {
          + delete_on_termination = (known after apply)
          + device_name           = (known after apply)
          + encrypted             = (known after apply)
          + iops                  = (known after apply)
          + kms_key_id            = (known after apply)
          + snapshot_id           = (known after apply)
          + tags                  = (known after apply)
          + throughput            = (known after apply)
          + volume_id             = (known after apply)
          + volume_size           = (known after apply)
          + volume_type           = (known after apply)
        }
      - ebs_block_device {
          - delete_on_termination = false -> null
          - device_name           = "/dev/sdb" -> null
          - encrypted             = true -> null
          - iops                  = 150 -> null
          - kms_key_id            = "arn:aws:kms:us-east-1:933752197999:key/9630f91f-f3c0-42eb-b65d-3defffc79926" -> null
          - tags                  = {
              - "AppCode"      = "IMGB-001"
              - "Name"         = "🏗 External Composer (staging)"
              - "ServiceOwner" = "Image Builder"
            } -> null
          - throughput            = 0 -> null
          - volume_id             = "vol-0daeecfc25da04a05" -> null
          - volume_size           = 50 -> null
          - volume_type           = "gp2" -> null
        }

      ~ enclave_options {
          ~ enabled = false -> (known after apply)
        }

      + ephemeral_block_device {
          + device_name  = (known after apply)
          + no_device    = (known after apply)
          + virtual_name = (known after apply)
        }

      ~ metadata_options {
          ~ http_endpoint               = "enabled" -> (known after apply)
          ~ http_put_response_hop_limit = 1 -> (known after apply)
          ~ http_tokens                 = "optional" -> (known after apply)
        }


      ~ root_block_device {
          ~ delete_on_termination = true -> (known after apply)
          ~ device_name           = "/dev/sda1" -> (known after apply)
          ~ encrypted             = false -> (known after apply)
          ~ iops                  = 100 -> (known after apply)
          + kms_key_id            = (known after apply)
          ~ tags                  = {} -> (known after apply)
          ~ throughput            = 0 -> (known after apply)
          ~ volume_id             = "vol-028a69697ce4637fe" -> (known after apply)
          ~ volume_size           = 25 -> (known after apply)
          ~ volume_type           = "gp2" -> (known after apply)
        }
        # (1 unchanged block hidden)
    }

  # aws_instance.composer_internal must be replaced
-/+ resource "aws_instance" "composer_internal" {
      ~ ami                          = "ami-0a8ee9c8284b8f3ff" -> "ami-07bb20d82c4e502f6" # forces replacement
      ~ arn                          = "arn:aws:ec2:us-east-1:933752197999:instance/i-0aca0a6ea3ad2b2bf" -> (known after apply)
      ~ associate_public_ip_address  = false -> (known after apply)
      ~ availability_zone            = "us-east-1a" -> (known after apply)
      ~ cpu_core_count               = 1 -> (known after apply)
      ~ cpu_threads_per_core         = 2 -> (known after apply)
      - disable_api_termination      = false -> null
      - ebs_optimized                = false -> null
      - hibernation                  = false -> null
      + host_id                      = (known after apply)
      ~ id                           = "i-0aca0a6ea3ad2b2bf" -> (known after apply)
      ~ instance_state               = "running" -> (known after apply)
      ~ ipv6_address_count           = 0 -> (known after apply)
      ~ ipv6_addresses               = [] -> (known after apply)
      + key_name                     = (known after apply)
      - monitoring                   = false -> null
      + outpost_arn                  = (known after apply)
      + password_data                = (known after apply)
      + placement_group              = (known after apply)
      ~ primary_network_interface_id = "eni-07088640399f60f49" -> (known after apply)
      ~ private_dns                  = "ip-10-30-18-11.ec2.internal" -> (known after apply)
      ~ private_ip                   = "10.30.18.11" -> (known after apply)
      + public_dns                   = (known after apply)
      + public_ip                    = (known after apply)
      ~ secondary_private_ips        = [] -> (known after apply)
      ~ security_groups              = [] -> (known after apply)
      - source_dest_check            = true -> null
      ~ subnet_id                    = "subnet-04a176042c3118735" -> (known after apply)
        tags                         = {
            "AppCode"      = "IMGB-001"
            "Name"         = "🏗 Internal Composer (staging)"
            "ServiceOwner" = "Image Builder"
        }
      ~ tenancy                      = "default" -> (known after apply)
      ~ user_data_base64             = "H4sIAAAAAAAA/9S7eZOcSH43/n9H7HvA2omwHePq5qhCKu3K4aKAOslsEjIp8M+h4OriSA4BdcDsvPdfJNXSdusa7/M8f9iKIDRk5vf+fI9UMcuq7OKym9h9Hb/nihPt0tpvuocivcbRX7igOpWR3/Qf3hgbQ1MgBuoCuW/u2NuExE2bVuV7Trjn/3T3p7vJ5OWhP9195q2mbV21aTee9bvOD5MiLru/cE8pjUu/iD+8Scu0uw+fjm/+TmU3ftk+xc1EK8MqSsvje+5tkHYvDowqd/G1ewhpdYomYVU+pcc/3RlpEX+j3J9fnrm7O7Vx076/47gJxzR4z8WhOGGLdxzHcW2bfPRPXVI16RBHH/O4H8+yPxPuTdsmk6b1ucVisVAkMPhLoQ9Fjb2qC3OhLBaL5cJcXrMnfbOhq6dlOU9Duu4Lp9GUxsYi3ctdbq1sIa7fRsvH4SJkruyUiUkfD0YdPzYpuIIDXb0LHTh/QHqtRPww1y+g/zV/Oibzp1MP3Ol886vhy7C3iXKcJaDSr0/osJql6y58sExaBpqe7morn9K0rqam1yldcVx8OubWQlaHpD8G8mlmzNOrvblOHSU7WQa/OpgDyOr4qU+d06/tBv2aiLgx891COZ02rhk0Gf1VT0jh78/NubeheGphdy5dJUuCx0sP34rOY+bXu+hhntj+p0dNuOi9jHWxPITTx+OFP6ZmILdpoNvDW2DHV0eamfN3n2oTOoa7C+uj11DLX693nmUk3QDfGpHXwL2OD5UlLOJFPz0mXQgaqNg0mFnnx7fSMPCfFKSL4RJOIX+pZ5fLp8fkfBHLLpBqe//YRXG3/ZXMePOxrMtDb1mlV4uDfgljUQgOV/ltmcxpmewb75jFb8PKLB8X+vUhpJKsWdv+mJ4eQ+Xyay68c0/UNQ74k690+WW7z1Gm1pl9EOOZsRXkSn3bbtfh9MGZ5f3T/hwZLUmiT8LysF4RAuuhOgb8fEbclEcHvS499CDE5Lh8QL86pO/cJ/cd3zwRGEaLSlx5T+V2NrgIH7bbueHlfnm9StpbDNNc24J5izOR5wd52ff85mnzyQ62gjJ7evsUSX6Imv1UDV0c6ZsHQemBI+tC9jb00sUKbncgGA46b0vd07srHwvmhw9c4WdV8x9NHCV+dx9WxZvXeI8jcTYT5iPmlzfMU0/dCMDWZmxt86gImU6ntazbSnpd2/IF5vLhXZk9eG/j6hGY2oPBX3bTd7MdVwWnyE9fCbu7NGkXf2QV4Tkta79L3nMPXVHf0vsjqxEfz37TjpqFtyrwnvvbs6LQUvBmr35cQsPY2B/eSaH/9I7n45k4E6fBVJg+vX2aBU8zP+YjKZwLYvhuLszFZ+olNB6hpaHP5PNAjGbybDadvZ2JkvTu7VQIpFj0Y//p3VtJfhuLkv9OjKZfC198XGrI/rC3+G5vCUuEo62dKioiW2xhb2vyOkbjHt8tc2FrYaQRDaim4x08XpcsvFU8nhKsAtMQ3QEQZYXzmRCIHh8XxsxWcxGtEhyISIl4hBxc7wOh3vprL7NzHSF82ZlUVyLe+4QIAWZO16atE4R1KeKvqcHPak+P2lCoVXDwssABkrVKMjsXPpmH6JFoRLYJ8mIsaMQGB38FoH2olehSs73pq71cP9hkiyKelA5GDia6hjSdjwqjtzI9IVLS2Ct+FpNaNnmgYJ5KSNc9K+/OTk6rqABwOeq8XWKsa54Y6VjTtfGsM1fZu5nrwCyVxiG6axFguEOyd5waYELLuFQQxEAxhO3eKKINUpWre9CHKDvuXLLNSG6IgBozL0+uCOOrj6/E0d5JhrpFcUYGX6wrQ6qv9pqucZZImLrnvQi2hrO5hplCYlLbLn/1DSGUCKl781LxQEWFK1WDfaDTQAcyEYiHBaU0c7r3V5EC13oX0toynHnhOqiP18Syl90Q5J5mOd3UkMLGHfSdR8jJKEBr6FG9pIR31O0aCZ6KaARsUT97OWocnaioJHtrHe2wE63sNRosDfiOA4qIRo6l1z7Ip9OIjy4G1X3H3szcIRGCg/LJIIsd1rzW0Yypt9J9WxMSR6cpshVgHZBjaGBjlYqEeHpxS3oKCMXBshtQScRARWeyEvp4XZ3jQyKHGhJJLjyGub4NzHoaiK0UUtKRNcnRiuhY2C5tMVIM3AkuFiyyJol1UFAwbPNA8q67YXFFhTuYeNoTDJSIJ4rp6JBowgodog0mVFtSzzK0+dKkVEd5JXm25xpSfvFW8za05juXerWb0zoS0QkLiwbkwhJqkWIQkluHCDlYWLpYX1lZRAE9DrGt5IF42f2AVvlMiw6RbqZzCWMPmFhYmo47/X5eXb9g1DzWCiprEYiUWnw4C/R6H+ab3nYE39f0q6VRI3auiS1RJ7RDCQ10aZMtRiW4OCXmjfVGQgKSXB5VUXEUEAZnS9fTZXFtIltxAZ67Ho9EZw2W4Wq+stZb0dC6R8u52kAgO+PgXsCqPVuUls46bIJVjcnaOMNDfQmyxCLFtQvX+Ix44dG28Q472zVedtDPiB8OpEC8d/C1qWTbGwE7HYHqdhesE2rleosPycYUrypekSnOAXBtfQYOC4msZiVUlb1FIz4mignNmsdiBMxyIQFCLM95xwOMp1ire6tcDP6anoG+nUKyRUjs+tgBlnWICjNPRF9KgFV4p1A0JMeai8ChAsqSLtYEeZkB3s2r2Y6vZwjrgrWurm4eCSEG7k7Sd5ggHC3nKBjcPsqjg4vzGRa8vUuNqUsSwxy2EJR65jvba5jhqZchzcrNnVWC1rbeSeEazMJMP4MD4t18ewI0F8yDMV+mt5qM8EzbaEDHFG1RTlWTIP1Wy/ndN52CFXpTJH20ooXvgCRaYXmZLo6bpaK5B5TAY3XcLBe3R/doWII6EKfyRjWOO1WZGmm++7K/VGzvsK1d53K0S9K5Belf0d8e0VCrKbSrqTtUF2OoKbDrAgx1DoaKh2qdu0N1NYZK8NRqcO3q4mbVDIzvde7ZdeLZ1RVk1RXadQpe6QdqT5wl0Zr0nqUowSo6hwXl/RUvb9agcu2NAGhUR6vEwryuBwXo44PC+878dLP59lgHMEQO6WGqqHYmnENxK/jONd8X8967vPJHEqxo7h/Q7CX9+Gizc7RUlp7jncMCyxutToJ0cTXYo1Y9sKseLhe9oW6uGy0CZPG1nxQYSObRdDzeO2yOMFV2rjM9GvaCPbKRYdnIjkcjWwyGpaxtYr6KQ+RsP3kO4GGq0MDR60DTc2+9paFkzAMJpJFDW29F+pBXes9BlXswT644717agSWS+gXJoqViRs629R3jaIlkttHoySveyd/YrCuCW1xrt1f23iE/ms61DKQt83cHU6UPxR/7/IXuFua1I16TNFjRbI87GtvVcaduLkA9Ht2C8jvzG0yNj+3M88i5CuFQ7b63//xcDLUuQFbnnlpnLBbQrhNgs8ZYzaBaCUZW8SCr2CWCQrvOjKxiMRuM7Gd8FQoyxreajfHNKt5T68KzK8mwq8EdKtHN6hTY1cAw79mMfyW4dp159k/1nXlMr5FPnbp21btDJbFcMbJKZPSGWl2Z3s+8WG5dRr1/zrf31EoEQyUZap0xvh7zwVCnbA2odeEyvzA7srow1Ip3s0o07Er4OV+lcO1RH9FTxzxlvughk5FVA9PPG/3D9KtTpqdrj3nOe+pP9WW8eMOuC2NgzbUujKzOmZ5sDahV72asNrAaUc1cu6Yszqye/EHcEndgPKoB2kznunCHsTaJQB39S92smhrDaIfk2reYetno55/py4/1aWB4qqkxVFePxeeGuQvT28sqAd782hv2WBMEz64u4Of4lRg23WG06wJVxrsu3GzE2fWZx8ywWWzrhOGG4cxjeP4pX4UaaiU+58LUU+sEqDUFQzX1br6ZeRnDX03dYeQlGgzPGbPr53641fCaMr2ZH1m8vVt+Mf2m4LnOA7USQFZNmQ0gG/3/M74jZozRF9WV+cPL6sQY5Ywx5JntLsMMW2dn7erCcukP+I7+Yv6EKsPnaJ9k3HLwwuID1WrKsGyMeyMeBqDWifvzuPGezXK06o2M5cKIjSlU2fsoa/Q1ZLhmMWV+YXmXVdc/iFsBR5yy2lWn7sBwXw2sBjEcj7gbsXHL8TFnGN5YXvw8j1Nwy/t+1EW9xQ9k1cWw68QYa1uds1x0s7FnX1h+GOof1YfFANWxRk5ZHrisXqm3GQCqLI4jji8j3uxKgLf+z2pU4v00jxes/qXg8v3egA7JJRBnNChNeaO6ArANabM8XmJVuxjq4vqqp+hHwVCpaPQKjdeIBuPMMxu+nWUUF9iLWZQZR7PQB9YfTXF+CiXUuw49RWtD3qxA7x9Q7Yp6+4N+p5p2vTLx1Ubf9LW/83/Ri8feajlML1R7BaVhVh2/z3shArVW0FiP6xWyaw3Z9dKwa41hDqm1zvoGWzfteglvvWnJ8AOYTnYloqzWUVYrhl2r6Gf2Hwjvr+bM1tlG62hsKVtvRU63uZLNUovvx27V0dihOcyoDnOkwxzPYBZpMHd7mJtXmCMFZhsB5vpyXMvIEmZYhNlGhLkxhVmyhNlCgpkrwcycwtxbwXyr/MDXmn/YQtcRKEznP5/tXjyhSHrf0VuYgRXMwgHmTFa0glmkwwytYKYJMNMGmHk6zLUrzL3leG48a/Yw9zSY4ynMmL54uJ0xL8uf+HOcs3QyuE5EYapk4xzrgCT4Zk58xveKlv4BJcFSsX0nOrkHJIQFbp9jweauOlwlNCwElgPfxMJR8QUe3GGjkWm0IidvRfJnWhKKeunZP8KYgm3dOBKRpBsd0LD0aJgqSnRAlefM+Nudgp6Dn9j6AttKsEY0LGaMRvQs5TlWP8COhiAe6iwQhUsgARqms9fx7C9HpM1sWAKe+XFfgHNwUM4snvtiPrglqYOVeQqkbblfKppNDdk9RMPPzj3fjV76+Os5d/BXWg9s7+AfUIUpUJAzy8KSXr71g5LAMdeqmcHuQtnYx7JxtrnNcKxHsD54/TxHsrrL5gXWp8e5xx5nylf+cUVDhquN7GWaDIaFDEQse/ZC9hxN9gosg9VGNuxcNrJc9lRNdm0se6oru4UmG+pR9lZYhrb5er5fEQqzI8NvD4ttAgsvg5lSwOw4g9mC5WUOs/xyO0MKWGxzmLlTWJAEFriHGTsffnUfVFgPmrHeMd712HzI+hazSWWz0jjLjP2bzYngNjvMPNYv1Kr32DyajfPNK/uhY8heZsrANmR3MGXXPo6+MApX9hwsGwOzE8uuiGXI3m1NhiqWDTWU3SEc17xs8dp+dcHDLMlhYfCw0AtYmDzMNBEW5hRmmwFmSg4LzMPCvcJsM4VZKMLsOMBM42HmiiNdZl6/6iEzNnt66njvZfPDMN5/7fGdzZ2sp2dg7Nl1cuvflcjuxm5WXTx21xjqFH41zxg2lkHmytA2ZMD8MNrI7GJxN2UwbGRXZDZvZGCHMlAZVo6ya7uyO/qN2e9+FX89g4WewsydjTUsy2cw2xawwBdYaBeYuTzMNszWAWZHARZaDzN8hRkqYLaYjvuFJnwdf6DWqXGbU6/jrMzeM9b7Rz9Ixu3fAnjjOQfYjMf8NeJCHedKNte8xr8dysawkA1mn4hlwzFlg2F7xe7MoexmruwV2ugHg+WKao54BwPDTS6DgmFk81X8jyLMogxmegoLRGEW8jDTKSyMAWbGBWYghYUr3vpA2MNs08OMYWYjwEzJYEbpSPs6/uwew/I4M4ZxHhJGPNhjzk/BUOfP91FhvJ+yHGB2D3U6zvfjGpvZX9vPctwrXBmsTNlTTRmoxmibwfKgwLKbbWSjYOvaGHtWLzx1MeID2BvZs7+X/yCBWTi7YXpx+fyPTWZO1haeHk2eWESjKwsDhWh43NubNbAw1WKnVk1e7y0xUiKeLk0n2hJCtwEWlJ1wHAxb+eTy+GqongoclBuSxhM+Sp1DpGFCd5Y49y0nEV1+pmBMjGW+ReYhWvk5ITbebhGvXQkmSiRFhpsB6DvoEKyBbw5EdEUhi/ikcvkZ8HMi2QTpMRaweaCQaDlPxPGHAxkdwh3bi/iXe7USYMHGh2jrCV/p4XRLVCTOyx8KHJrsYqpvrOLqIzGpPM0Q/CPDsyJ5YqT7WFAMLVKxpK8xT1ODRwjhrYIJUUwbbc0cSeYhKj2e7E1nvjVzHSF1M7i8fgl1YjuENI69EV2eomUuCG62bUyhhntxpsOVJpFDJfm0TuJy0TsFSAMJ5IZWXyN+W7mH+uzztYQH/eTywjkiG8lTF01IahNqhPd1UgRCvnPp1gtwB8K++4TF7TJywBlQZDn5ZmoM0cwgysbQWhGIpIuwyRtrXY61+cEYkk9I2F5BhkDgEBFY85o4/EAOBHhmLbu8ru8HvbI1apOCLA0hnxqr6JOftgMinhtq3ikkie/l08YslYtjbxtgmzxwplJYAmjkbW+turOtkk/2QTfjQr8si0QLeOIEgndwcnQxBWUZF945cjZTLCS8Kc4JwrPW0uvUw9fGc8DO5+eqdQBTa+3yxnqrA0ffhhIefAx2QMV8UIY7oNM0xu7ZX+udva5LG4MZ0o6DpXXbSKelsdqmEU89shKgx0flXkIQDEBxyoiQFUUer18tmxSeCDLsCJQIOh9d6t44aIPpRMDMdQWJdellieSJnhTxSBl/fMoUbBJ9s+e3inWIFKTpuVlEkOQJAhpZeYJOnLzlHWvOg/J4CTJwXtKED20CAK9ddyJ/jop5BtcRwYRqhG4ufr7VAymyLayToDSlcOUVtr7pfRL1cHXlCV8PPr4ujQJt90N09bXoikm+s/HWizVPMwlYevzMMXMd2Njo4aH2Aupd3DxCkbMZrGJW+rp2dvt5vhe9BuqebmRetRsAjDNFNMT5I8rnlaEhxb7UIy9L16ZmrhdQI0sTC6pZ6ErEE+nZB62Z61LEg9LBdB8JdGlSnViaLqFD5Hy2C+dbHawjbGFKljTv4QFlaKCyQ5Mt08suaE7E6+DkhhAVoPMwWAf59OKQKA+0a2eXXupoW9Edtk6Mr923dk13nphU/soc7APxjIzyLh/OYlq71oF890fIr38YNImu29oWmRixnF6auCsNs24inmZx6elWafbYIRnRTMkS9Y1xQFmML1NH2zRAm/c7AUx9aXFxSXKInOiT51wfQU5JWG6mSEWNKSS+yVMXDPp5mXmCVYIs0qIM6WiAuOuJNnN9vrvEa3r1VKJCh+bhuroQO7GDIbH3EgGYJI9BkaxRvpl6Dp6aBMBYa88Ee7wnVju0IjjWuo2L0QqJWx2TWoYE7KPB7H2x7gMspETSa6uoD1Hf4QhvncBpe1yQFTgA4krgagruxVbRJaRbBx70WXisE5LPfXvZqZ5Qq7ioKxfXFllHlS8pOZbqKy4QCqWF5Dpgauf6Jkg7nqw6xV7TqytFSpCh3BJDPiiRGK6paRFAloVxDtYEBEI1RUMuGFoy2IfocS9Q7Ip0i3CNYoesjcGrogEt3X7eYf7Yo7x2cAEctAYHknuJl4VnskIWWoGpn7a7UMyvJtWHmOqdga9toAkX4ESSafO75x/JdTs3f9ADqw9f/+hiWfuPO821Pi4Q+OA35Xv/0r5v47CJu7bwS/8YN+9P7ST2224ivJ9L0tuZKMzfzufz51Pv07KLm9KnH8OqqKs2bsbPeyZtdW6m+bM4CyvWEm0e7Q0EH40FWKyevwxYAPX/XHJ7CtqwSesurcrJM8kkrIrCL6NJbrq0mn+W71q2ZnxcQ8sGC0P7+Ig0fXP40Hb+MS2Pk88mTD6b8LWX1A368BB34UPVBqeURl8ftLQl0mzri2kaUB/hBtgfMdp/SLqubt8/PJzrMJ7wkSAJs6nEy7PpPBDCaDIfrs3bYXa+f237/Rfb7xnhvV/4Q1X6l/Y+rIqHl190fE+vbxbuu6qg3//Q4z/zKkv/6/nFp7S6xNHHqCr8tGy5D9x/cm+62C/unzneV83xzb9xb5JTcB808eXr9UvV5HHz7Rb3WULocx+4N9/XOvQnYdPd13Hx5u6zdjeG/7B+/8/0+PF3eP/IF3XXSZvElN7w+qNP6v7pIUjLh8Bvk7s27rhJfKq4Oq3jJz+ld211asL4+x/w3P2ZW8Ud1yUxl5Zt55dhzG3U+7sNsOwFWGofN+qHX/4lPDWUm+xbjiHy/cODIM/vxdn0/vnvB+p3cds9FHHnTyK/8x8+85qk0b8yGYu2jYuAxlxStV3pF/H9nY73+y959eHNL799P9V+n/zy2wtlfr9/BvINmy/jw+Q8NmnZcdXpZlEZX14IjMOk4t5Ycdel5ZFr+7aLiy/bXFdxv/z2Sqff70eW1rN7viK4v/v8X2FHuTbuJl9Y/fKKzf8OGDw751YXA+agL3DoKg6twc0ZKD6mbRc3rwFzSbtkPHP3cGqbB1qFPh018S8t97o4cce4m9yWJmefnmLu/2MV6fNSGnG//PZHNf937m9c9ombNNybe2uks7omLY9vuH+/WfeyvH98FvzxubzfZ21V3n0m/9nJN/9NZtzfuNHjTcFNnv67Ctx9rwU9f5LLTSb+qav+NwFHjWta9Qw2rIVzfhlxYdx06VMastJwA8/t0Aid57zllouX5+7vAr+N5Sk3ibgJ99e//pX75bevvuf7nft37pffXrbX31/U3K+kfC4TfyTj1Yck35XwzOiP5ORx/3+RA3EZ1VVadhNWbX/57Wejwe/fSZvvTmZ/mCuvZq/XyfFy682PTt/Q/8WhP/Edcw7z3Ys8+Y7w/ymgv9MU66NlQ7RYaR8eovj8UJ6LWCiFO8te2NptsDv7zQNNg2+Hu6+azan+O0barmr8Y/z35nKqP69xVfnl3P1d+sT9E3ds4pph4bPM37mHuqnCh6I6lV37Fwa/8o7j/sxpZXtqYk5TLC5tuacTpT0b2Mo47OKIe0qbtru/47inquHsjaEhLi253/j7e4nnf/8LF1XjbJM+cW3nd9wvL4z/IoP9CZrYv43mT+nt+3waxzUn3HFcVJXx3ajKMonDnPE66Nb4fxY8t8605XzaxH7Uc4UfxUyd0cbrU/sxLZ+qH4kt8qf2/vrUvtq/G1UY5Rl+/qWiTF742e9iLkqbOOyqpmeiirRt0/LIBBd5lDbc5LVvb+wWUcR63jjfPbWdH4zlbHQ4o7xF9pffXujy++sIMVWj+Mk/0a7leI5/w/2N6+KYm/gvmDIdGMvXRo0KoJjB0dL2aXm63qbua9cy2U3MkBKHVclN0Jn7jL8bGcPSC2/XcTPaW5UjaZhUF0bFffzaU++/WfmOU0jcpE+s2vnP09AzYtOWuzRp5wc0vuO4rjqFySvqh/u6qc4pUyMtjx9DBg1myFgD/vDgU/o/ph78d6an72V73JzT8HMHXETZqe3+vttVHGXzVMky3+fKqpywkSrym4irq6a7+TttORq3LUfTPKY9Iwriuz9zbeiXZRyN6KybKoij+7s/czZU4b8Uid9Hcfmv7zmHTcHsUBgyFgxATRqyoaNlMm9TcseuPByNzzHl/I5rq4LxH3vRv3HBqeMuMUvvf+64xD/HXNpxTXpMOq6sLvd3XzJpxPYNfNHz398Uxolfp/dtFeZxdx893LGs+MfJqnPcNGkU34dV+cT62FidT5Ryf/0rp0H97j+t8eh/3e1H51pdE/vFh9dv83dv5Tt2+CaSDfGRHxdVOWliWvnR7TYR137zbW35Z+bIoupi7nZX/BLlMRY3Pdv7F5wLv82/cLnR/Idw/0z14lxcskTiJpOyunw5fxP1TPbshT+i+Y7jvsmkyeRPd/9/AAAA//8GYWtSdTYAAA==" -> "H4sIAAAAAAAA/9S7eZOcSH43/n9H7HvA2omwHePq5qhCKu3K4aKAOslsjkwK/HMogKSLIzkE1AGz895/kVRL261rvM/z/GErgtCQmd/78z1SxSyrsovLbuL0dfyeK060S+ug6R6K9BqTv3BhdSpJ0PQf3hgbQ1MgAurC8t7csbcJjps2rcr3nHDP/+nuT3eTyctDf7r7zFtN27pq0248G3RdECVFXHZ/4Z5SGpdBEX94k5Zpdx89Hd/8ncppgrJ9ipuJVkYVScvje+5tmHYvDowqd/G1e4hodSKTqCqf0uOf7oy0iL9R7s8vz9zdndq4ad/fcdyEYxq85+JInLDFO47juLZNPganLqmadIjJxzzux7Psz4R707bJpGkDbrFYLBQJDMFS6CNRY6/qwlwoi8ViuTCX1+xJ32zo6mlZztOIrvvCbTSlcZBI93KX2ytHiOu3ZPk4XITMk90yMenjwajjxyYFV3Cgq3eRC+cPll4rhB/m+gX0v+ZPx2T+dOqBN51vfjUCGfYOVo6zBFT69ck6rGbpuosebJOWoaanu9rOpzStq6npd0pXHBefjrm9kNUh6Y+hfJoZ8/TqbK5TV8lOtsGvDuYAsjp+6lP39Gu7sX5NRNSY+W6hnE4bzwybjP6qJ7gI9ufm3DtQPLWwO5eekiXh46WHb0X3MQvqHXmYJ07w6VETLnovI10sD9H08Xjhj6kZym0a6s7wFjjx1ZVm5vzdp9qEruHtovroN9QO1uudbxtJN8C3BvEbuNfRobKFRbzop8eki0ADFYeGM/v8+FYaBv6TYulitIRTyF/q2eXy6TE5X8SyC6Xa2T92JO62v+IZbz6WdXnobbv0a3HQL1EsCuHhKr8tkzktk33jH7P4bVSZ5eNCvz5EVJI1e9sf09NjpFx+zYV33ol6xgF9CpQuv2z3uZWpdeYcxHhmbAW5Ut+223U0fXBnef+0PxOjxQn5JCwP6xXGsB6qY8jPZ9hLeeug16VvPQgxPi4frF9d3Hfek/eOb54wjMiiElf+U7mdDZ6FDtvt3PDzoLxeJe0tgmmubcG8RZnI84O87Ht+87T55IRbQZk9vX0iUhBZzX6qRh4i+uZBUHrgyrqQvY38dLGC2x0Ih4POO1L39O7Kx4L54QNXBFnV/EcTkyTo7qOqePMa7zERZzNhPmJ+ecM89dWNABxtxtY2j4qQ6XRay7qjpNe1I19gLh/eldmD/zauHoGpPRj8ZTd9N9txVXgiQfpK2N2lSbv4I6sIz2lZB13ynnvoivqW3h9Zjfh4Dpp21Cy6VYH33N+eFYW2gjZ79eMSGsbG+fBOioKndzwfz8SZOA2nwvTp7dMsfJoFMU+kaC6I0bu5MBefqZfQeIS2Zn0mf/s0iyWZkPn0nTDjn4JoGvKSLMmRTKR5GL6VYzF+J5Cnr4UvPi41y/mwt/lubwtLC5GtkyqqhbfIRv7W5HVkjXt8t8yFrY0sDWtANV3/4PO6ZKOt4vMUIxWYhugNACsrlM+EUPT5uDBmjpqL1ipBoWgphLcsF9X7UKi3wdrPnFy3LHTZmVRXCO9/sjAGZk7XpqNjC+kS4a+pwc9qXydtJNQqOPhZ6ALJXiWZkwufzAN5xBqWHWz5MRI07IBDsALQOdQKudRsb/pqL9cPDt5ahMeliywXYV2zNJ0nhdHbmZ5gKWmcFT+LcS2bPFAQTyVL1307785uTitSALgcdd4uEdI1XyQ60nRtPOvOVfZu5jowS6Vxse7ZGBjekOxdtwYI0zIuFQsioBjCdm8UZGOpytU76APJjjsPbzOcGyKgxszPk6uF0DVAV+xq7yRD3VpxhodArCtDqq/Omq5RlkiIeue9CLaGu7lGmYJjXDsefw0MIZIwrnvzUvFAtQpPqgbnQKehDmQsYB8JSmnmdB+siALXehfR2jbceeG5Vh+vse0suyHMfc12u6khRY036Dsf45NRgNbQSb2kmHfV7doSfNWiBDiifvZzq3F1rFol3ttrskMuWTlra7A1ELguKAglrq3XAcinU8KTi0H1wHU2M29IhPCgfDLwYoc0v3U1Y+qv9MDRhMTVaWo5CrAPlmtoYGOXimTx9OKV9BRiisJlN1glFkPVOuOV0Mfr6hwfEjnSLBHnwmOU69vQrKeh2EoRxR1e49xaYR0J26UjEsVAneAhwcZrnNgHxQqHbR5K/nU3LK5W4Q0mmvYYAYXwWDFdHWJNWFkHskGYakvq24Y2X5qU6lZeSb7je4aUX/zVvI3s+c6jfu3ltCaidULCogG5sIQaUQyMc/tALBcJSw/pKzsjFNDjEDtKHoqX3Q9olc+01oHoZjqXEPKBiYSl6XrT7+fV9QtGzWOtWGUtApFSm49moV7vo3zTO64QBJp+tTVqxO41cSTqRk4kWQNdOniLrBJc3BLxxnojWYIlebxVkeIoWAicbV1Pl8W1IY7iATT3fN4S3TVYRqv5yl5vRUPrHm336gAB74yDdwGr9mxTWrrrqAlXNcJr4wwP9SXMEhsX1y5ao7PFC4+Og3bI3a7RsoNBhoNowIXF+4dAm0qOsxGQ22GobnfhOqF2rrfokGxM8aqiFZ6iHADP0WfgsJDwalZCVdnblPAxVkxo1jwSCTDLhQQwtn33HQ8QmiKt7u1yMQRregb6dgrx1rLEro9dYNsHUph5IgZSAuzCP0WiIbn2XAQuFaws6WJNkJcZ4L28mu34emYhXbDX1dXLiRAh4O0kfYewhchyboWD15OcHDyUz5Dg7z1qTD2cGOawhaDUs8DdXqMMTf3M0uzc3NklaB37nRStwSzK9DM4WLyXb0+A5oJ5MObL9FaTLTTTNhrQEbW2Vk5VE1v6rZbzu286BSv0poh7sqJF4IKErJC8TBfHzVLRvIOVwGN13CwXt0f3aVSCOhSn8kY1jjtVmRppvvuyv1Qc/7CtPfdydErceQXuX9HfHtFQqyl0qqk3VBdjqClw6gIMdQ6GiodqnXtDdTWGSvDVavCc6uJl1QyM73XuO3XiO9UVZNUVOnUKXukHal+cJWSNe99WlHBFzlFB+WDFy5s1qDxnIwBKarJKbMTreliAPj4ofODOTzebb499AANxcQ9TRXUy4RyJWyFwr/m+mPf+5ZU/knBF8+BgzV7Sj482O5OlsvRd/xwVSN5odRKmi6vBHrXqgVP1cLnoDXVz3WgE4MXXflJgKJlH0/V5/7A5wlTZee70aDgL9shGhmQjOx6NbDEYtrJ2sPkqDsTdfvJdwMNUoaGr16Gm5/56SyPJmIcSSIlLW3+F+4hXet+1Ku9gnjxx3r20A0k4DQqckaViEnfbBq5xtEU822j05Bfv5G9s1hXBK6611yt7/5AfTfdahtKW+buDqdJH4o99/kJ3G/HaEa1xGq5otkcdjZ3quFM3F6Aej15B+Z35DabGx3HnOXGvQjRUu+/tPz8XQ60LkNW5r9YZiwV06gQ4rDFWM6hWgpFVPMgqdomg0KkzI6tYzAYj+xlfhYKM8a1mY3yzivfVuvCdSjKcavCGSvSyOgVONTDM+w7jXwmeU2e+81N9Zz7Ta+RTp55T9d5QSSxXjKwSGb2hVlem9zMvlluXUe+f8+19tRLBUEmGWmeMr898MNQpWwNqXXjML8yOrC4MteK9rBINpxJ+zlcpPGfUR/TVMU+ZL3rIZGTVwPTzR/8w/eqU6ek5Y57zvvpTfRkv3nDqwhhYc60LI6tzpidbA2rVexmrDaxGVDPPqSmLM6snfxC3xBsYj2qADtO5LrxhrE0iUEf/Ui+rpsYw2iF5zi2mfjb6+Wf68mN9GhieamoM1dVn8blh7sL09rNKgDe/9oYz1gTBd6oL+Dl+JYZNbxjtukCV8a4LLxtxdn3mMTMcFts6YbhhOPMZnn/KV6GGWonPuTD11ToBak3BUE39m29mfsbwV1NvGHmJBsNzxuz6uR9uNbymTG/mRxZv/5ZfTL8peK7zQK0EkFVTZgPIRv//jO+IGWP0RXVl/vCzOjFGOWMMeWa7xzDD1tlZp7qwXPoDvqO/mD+hyvA52icZtxy8sPhAtZoyLBvj3oiHAah14v08brzvsByteiNjuTBiYwpV9j7KGn0NGa5ZTJlfWN5l1fUP4lbAEaesdtWpNzDcVwOrQQzHI+5GbNxyfMwZhjeWFz/P4xTc8r4fdVFv8QNZdTGcOjHG2lbnLBe9bOzZF5YfhvpH9WExQHWskVOWBx6rV+ptBoAqi+OI48uIN6cS4K3/sxqV+D/N4wWrfym4fL83WIfkEoozGpamvFE9ATiGtFkeL7GqXQx1cX3VU/SjYKhUNHqFxmuLhuPMMxu+nWUUDziLGcmMo1noA+uPpjg/RZLVey49kbUhb1agDw5W7Yl6+4N+p5pOvTLR1bG+6Wt/5/+iF4+91XaZXlbtF5RGWXX8Pu+FCNRascZ6XK8sp9Ysp14aTq0xzFlqrbO+wdZNp17CW29aMvwAppNTiVZW61ZWK4ZTq9bP7D9gPljNma2zjdbR2Fa2/gqfbnMlm6UW34/dqqOxS3OYUR3mlg5zNIMZ0WDu9TA3rzC3FJhtBJjry3Etw0uYIRFmGxHmxhRmyRJmCwlmngQzcwpzfwXzrfIDX2vBYQs9V6Awnf98tnvxRCLuA1dvYQZWMIsGmDNZZAUzosPMWsFME2CmDTDzdZhrV5j7y/HceNbsYe5rMEdTmDF90XA7Y16WP/HnOGfpePBcQmGqZOMc64Ik/GZOfMb3ipbBwUrCpeIELjl5B0uICtQ+x4LNXXW0SmhUCCwHvomFq6ILPHjDRsNTssInf4XzZ1ociXrpOz/CmIIc3ThiEacbHdCo9GmUKgo5WJXvzvjbnYKew5/Y+gLbSri2aFTMGI3o28pzrH6AHc2CaKizUBQuoQRolM5ex7O/HC1t5sAS8MyP+wKcw4NyZvHcF/PBK3EdrsxTKG3L/VLRHGrI3oEMPzv3fDd66eOv59whWGk9cPxDcLAqRIFiubMsKunlWz8oCRxzrZoZ7C6UjX0sG2eb2wzHegTrg9fPcySru2xeYH16nHuccaZ85R9PNGS42sh+pslgWMhARLLvLGTf1WS/QDJYbWTDyWUjy2Vf1WTPQbKverJXaLKhHmV/hWTomK/n+xWmMDsy/Paw2Caw8DOYKQXMjjOYLVhe5jDLL7czuIDFNoeZN4UFTmCBepix89FX90GF9aAZ6x3jXY/Nh6xvMZtUNiuNs8zYv9mcCG6zw8xn/UKtep/No9k437yyH7qG7GemDBxD9gZT9pzj6Auj8GTfRbIxMDuR7IlIhuzd0WSoItlQI9kbonHNzxav7VcXPMySHBYGDwu9gIXJw0wTYWFOYbYZYKbksEA8LLwrzDZTmEUizI4DzDQeZp440mXm9aseMmOzp6+O9142Pwzj/dcZ39ncyXp6BsaeXSe3/l2J7G7sZdXFZ3eNoU7hV/OM4SAZZJ4MHUMGzA+jjcwuFndTBsNG9kRm80YGTiQDlWHlKHuOJ3uj35j93lfx1zNY6CnMvNlYw7J8BrNtAQt0gYV2gZnHw2zDbB1gdhRgofUwQ1eYWQXMFtNxv9CEr+MP1Do1bnPqdZyV2XvGev/oB8m4/VsAbzznAJvxmL9GXKjjXMnmmtf4dyLZGBaywewTkWy4pmwwbK/YnTmSvcyT/UIb/WCwXFHNEe9gYLjJZVAwjGy+iv9RhBnJYKansLAozCIeZjqFhTHAzLjADKSw8MRbH4h6mG16mDHMbASYKRnMKB1pX8ef3WNYHmfGMM5DwogHZ8z5KRjq/Pk+Koz3U5YDzO6hTsf5flxjM/tr+1mO+4Ung5Up+6opA9UYbTNYHhRI9rKNbBRsXRtjz+qFry5GfABnI/vO9/IfJDCLZjdMLy6f/7HJzPHaRtOjyWMba3RlI6BgDY17e7MGNqJa7Naqyeu9LRKF8HRpumSLMd2GSFB2wnEwHOWTx6OrofoqcK3ckDQe8yR1D0RDmO5scR7YbiJ6/ExBCBvLfGuZB7IKcowdtN1avHbFCCtEIoaXARi41iFcg8AcsOiJQkb4pPL4GQhyLDnY0mMkIPNAIdZyHovjDweydYh2bI/wL/dqJUSCgw5k6wtf6eF2S6tI3Jc/FLg02cVU39jFNbDEpPI1QwiODM+K5ItED5CgGBpRkaSvEU9Tg7csC20VhLFiOtbWzC3JPJDS5/HedOdbM9ctS90MHq9fIh07LsaN62xEj6fWMhcEL9s2plDDvTjT4UqT8KGSAloncbno3QKkoQRyQ6uvhN9W3qE+B3wtoUE/ebxwJngj+eqiiXBtQg3zgY6LUMh3Ht36IepA1HefkLhdEhecAbVsN99MjYHMDKxsDK0VgYg7gkzeWOtyrM0PxpB8soTtFWQWCF0sAnteY5cf8AED36xlj9f1/aBXjkYdXOClIeRTY0U+BWk7WNj3Is0/RTgJ/HzamKVycZ1tAxyTB+5UikoAjbzt7VV3dlT8yTnoZlzol2WRaCGP3VDwD25uXUxBWcaFfybuZoqEhDfFObbQrLX1OvXRtfFdsAv4uWofwNRee7yx3urA1beRhIYAgR1QER+W0Q7oNI2Rdw7Weues69JBYGZpx8HWui3RaWmstinhqY9XAvR5Uu4lC4IBKG5JMF5Ry+f1q+3gwhdBhlyBYkHnyaXujYM2mC4BZq4rlliXfpZIvuhLhLeU8cenTEEm1jd7fqvYB6JYmp6bBYE4Tyyg4ZUv6NjNW9615zwoj5cwA+clTfjIwQDw2nUn8mdSzDO4JhhhqmG6uQT5Vg8l4thIx2FpStHKLxx90weY9HB15TFfDwG6Lo3C2u4Hcg00ckU43zlo68ear5kYLH1+5pq5Dhxk9PBQ+yH1L15OLOJuBruYlYGunb1+nu9Fv4G6rxuZX+0GAONMEQ1x/mjl88rQLMW51CMvW9emZq4XUMNLEwmqWegK4bH07IPWzHWJ8KB0Ed0TgS5NqmNb0yXrQNzPdqF8q4M1QTaieEnzHh6szBqo7NJky/RyCppj8Tq4uSGQAnQ+Auswn15cTPJQu3ZO6aeuthW9YevG6Np9a9d054tJFazMwTlg38go7/HRLKa1Zx/wd3+E/PqHQRPruqNtLRNZLKeXJupKw6wbwtMsLn3dLs0euTjDminZor4xDlYWo8vU1TYN0Ob9TgDTQFpcPJwciEs++e71EeQUR+VmaqlWYwpJYPLUA4N+Xma+YJcgIxrJLN0aIOp6rM28gO8u8ZpefRWr0KV5tK4u2EmccEicvYQBwsljWCRrK99MfRdNTQxgrLVnjHzeF6udtcIo1rqNh6yVJW51hGsZYrAng9kHYt2HSEixpNd2UR9I3yGCtm7otj0q8AocAPYkcDUF7+Ko1iWiWxce9Fl0rBOczwNn2am+UKuoqCsP1TZekyqQlBxJ9RUVlhVJC8lzwdTJ9U2YdjxedYqzpldPIkqYWbktRnxYWmK0pqaNAV4WxjlcYxAK1dQacsHQksE5kMe9QJEn0q2Fait28doY/IoM1tLr5x3ij72V1y4qgGutwQHnfuJn0RmvLNtagWmQtrtIzK8m1YeY6p2Brm2oCRfgEsl0+N3zj+S6k5s/6IHVh69/dLHt/ced5tkfFxb4EDTl++DSvm/jqIm7tgjK4Bg370/tJA7abiK8n0vS25kozN/O5/PnU+/TsoubMqAfo6qoqzZuxs97Jm11bqb5szgbKfbS2jw6Gwg+GguwWD1/GbAA6v+55PYUtlGT1l1alZNnkklUFUVQkkluerSaf5bv2Y5mfFxD2wELQ/v4aGn65vCh7YJjWh4nn02YfDbhay+pG+vDQ9xFD1UbnlJKvj5oa0tLc+wvpmlAfYQb4HxE1v5D0nV1+/7h4VxH8YQngiTMphIvz6bzUIjIZD5cm7fD7Hz/2vb7L7bfM8L7oAiGqgwu7X1UFQ8vv+j4nl7fLNx3VUG//6HHf+ZVlv7X80tAaXWJyUdSFUFattwH7j+5N10cFPfPHO+r5vjm37g3ySm8D5v48vX6pWryuPl2i/ssIQq4D9yb72sdBZOo6e7ruHhz91m7G8N/WL//Z3r8+Du8f+SLuuukTWJKb3j90Sd1//QQpuVDGLTJXRt33CQ+VVyd1vFTkNK7tjo1Ufz9D3ju/syt4o7rkphLy7YLyijmNur93QbYzgIstY8b9cMv/xKdGspN9i3HEPn+4UGQ5/fibHr//PcDDbq47R6KuAsmJOiCh8+8Jin5VyZj0bZxEdKYS6q2K4Mivr/T0X7/Ja8+vPnlt++n2u+TX357oczv989AvmHzZXyYnMcmLTuuOt0sKuPLC4FxlFTcGzvuurQ8cm3fdnHxZZvrKu6X317p9Pv9yNJ+ds9XBPd3n/8r6ijXxt3kC6tfXrH53wGDZ+fc6mLIHPQFDl3FWWtwc4YVH9O2i5vXgLmkXTKeuXs4tc0DraKAjpoEl5Z7XZy4Y9xNbkuTc0BPMff/sYr0eSkl3C+//VHN/537G5d94iYN9+beHunsrknL4xvu32/WvSzvH58Ff3wu7/dZW5V3n8l/dvLNf5MZ9zdu9HhTcJOn/64Cd99rQc+f5HKTSXDqqv9NwFHjmlY9gw1r4VxQEi6Kmy59SiNWGm7guR0aofOct9xy8fLc/V0YtLE85SaEm3B//etfuV9+++p7vt+5f+d++e1le/39Rc39SsrnMvFHMl59SPJdCc+M/khOHvf/FzkQl6Su0rKbsGr7y28/Gw1+/07afHcy+8NceTV7vU6Ol1tvfnT6hv4vDv2J75hzmO9e5Ml3hP9PAf2dptgfbQdai5X24YHE54fyXMRCKdzZzsLRboPdOWgeaBp+O9x91WxO9d8x0nZVExzjvzeXU/15javKL+fu79In7p+4YxPXDAufZf7OPdRNFT0U1ans2r8w+JV3HPdnTivbUxNzmmJzacs9nSjt2cBWxlEXE+4pbdru/o7jnqqGczaGZnFpyf3G399LPP/7XzhSjbNN+sS1XdBxv7ww/osM9ids4uA2mj+lt+/zaRzXnHDHcaQq47tRlWUSRznjddDt8f8seG6dacsFtIkD0nNFQGKmzmjj9an9mJZP1Y/EFvlTe399al/t340qjPKMIP9SUSYv/Bx0MUfSJo66qumZqCJt27Q8MsFFTtKGm7z27Y3dghDW88b57qntgnAsZ6PDGeUtsr/89kKX319HiKlK4qfgRLuW4zn+Dfc3rotjbhK8YMp0YCxfGzUqYMUMjra2T8vT9TZ1X7uWyW5ihpQ4qkpuYp25z/i7kTEsvfB2HTejvVU5kkZJdWFU3MevPfX+m5XvOAXHTfrEql3wPA09IzZtuUuTdkFI4zuO66pTlLyifrivm+qcMjXS8vgxYtBghow14A8PPqX/Y+rBf2d6+l62x805jT53wAXJTm33992u4iibp0qW+QFXVuWEjVQkaAhXV01383facjRuW46meUx7RhTGd3/m2igoy5iM6KybKozJ/d2fOQeq8F+KJOhJXP7re85lUzA7FEWMBQNQk0Zs6GiZzNuU3LErD0fjc0y5oOPaqmD8x170b1x46rhLzNL7nzsuCc4xl3Zckx6Tjiury/3dl0wasX0DH3n++5vCOAnq9L6tojzu7snDHcuKf5ysOsdNk5L4PqrKJ9bHxup8opT76185Dep3/2mPR//rbj861+6aOCg+vH6bv3sr37HDN5FsiCdBXFTlpIlpFZDbbSKug+bb2vLPzJFF1cXc7a74JcpjLG56tvcvOBdBm3/hcqP5D+H+merFubhkicRNJmV1+XL+JuqZ7NkLf0TzHcd9k0mTyZ/u/v8AAAD//7c3nUB1NgAA" # forces replacement
      ~ vpc_security_group_ids       = [
          - "sg-084607083aaa39727",
          - "sg-0eb65fd8f2c17dba5",
        ] -> (known after apply)
        # (3 unchanged attributes hidden)

      - credit_specification {
          - cpu_credits = "unlimited" -> null
        }

      + ebs_block_device {
          + delete_on_termination = (known after apply)
          + device_name           = (known after apply)
          + encrypted             = (known after apply)
          + iops                  = (known after apply)
          + kms_key_id            = (known after apply)
          + snapshot_id           = (known after apply)
          + tags                  = (known after apply)
          + throughput            = (known after apply)
          + volume_id             = (known after apply)
          + volume_size           = (known after apply)
          + volume_type           = (known after apply)
        }
      - ebs_block_device {
          - delete_on_termination = false -> null
          - device_name           = "/dev/sdb" -> null
          - encrypted             = true -> null
          - iops                  = 150 -> null
          - kms_key_id            = "arn:aws:kms:us-east-1:933752197999:key/9630f91f-f3c0-42eb-b65d-3defffc79926" -> null
          - tags                  = {
              - "AppCode"      = "IMGB-001"
              - "Name"         = "🏗 Internal Composer (staging)"
              - "ServiceOwner" = "Image Builder"
            } -> null
          - throughput            = 0 -> null
          - volume_id             = "vol-058d1cec56397f102" -> null
          - volume_size           = 50 -> null
          - volume_type           = "gp2" -> null
        }

      ~ enclave_options {
          ~ enabled = false -> (known after apply)
        }

      + ephemeral_block_device {
          + device_name  = (known after apply)
          + no_device    = (known after apply)
          + virtual_name = (known after apply)
        }

      ~ metadata_options {
          ~ http_endpoint               = "enabled" -> (known after apply)
          ~ http_put_response_hop_limit = 1 -> (known after apply)
          ~ http_tokens                 = "optional" -> (known after apply)
        }


      ~ root_block_device {
          ~ delete_on_termination = true -> (known after apply)
          ~ device_name           = "/dev/sda1" -> (known after apply)
          ~ encrypted             = false -> (known after apply)
          ~ iops                  = 100 -> (known after apply)
          + kms_key_id            = (known after apply)
          ~ tags                  = {} -> (known after apply)
          ~ throughput            = 0 -> (known after apply)
          ~ volume_id             = "vol-07e74c1c0bb417d98" -> (known after apply)
          ~ volume_size           = 25 -> (known after apply)
          ~ volume_type           = "gp2" -> (known after apply)
        }
        # (1 unchanged block hidden)
    }

  # aws_launch_template.worker_external_x86 will be updated in-place
  ~ resource "aws_launch_template" "worker_external_x86" {
      ~ default_version         = 10 -> (known after apply)
        id                      = "lt-04e6df10bd74694e7"
      ~ image_id                = "ami-0a8ee9c8284b8f3ff" -> "ami-07bb20d82c4e502f6"
      ~ latest_version          = 10 -> (known after apply)
        name                    = "imagebuilder_worker_external_x86_staging"
        tags                    = {
            "AppCode"      = "IMGB-001"
            "Name"         = "🔧 External Composer Worker (staging)"
            "ServiceOwner" = "Image Builder"
        }
      ~ user_data               = "H4sIAAAAAAAA/9R4WXOrSJr2vSLqP/C5TsTXHWeQWIRkucsVLSTQSiISkq1nwpFASiBSgCG1njr/fUK2fNpnqenumb4p39hkvls+PPm8Lx6VBSMF451zRR643Z6yrMI16+yyE0n+wkXlvkhwfX68M2aGppoIjIcwuGtdn3iX1E1WFg+c2BZ+av3U4vn3Rj+13mKPs6Yqm4y92GLGcJzuSMH+wq0zSgq8I493WZGxdrze3P3dy6lx0axJzWtFXCZZsXng+lHG3hm8lMzIiXViWu4TPi6Ldbb5qWVkO/JdcT+/t2m19g2pm4cWx/HctYIHjsQSf11scRzHNU36hPcsLevsQpKnnJxfbK8/PHfXNClfN5gbDodDVQYXPBLPsaRdH8dDa6gOh8PR0Bqdtmt9NqOT9agYZDGdnnderam1gyS67LHcnjgiqfrJaHU5itug5xWpRVe+UZFVnYET8OnkPvbMQQfqlZoIl4F+BOeP+XqTDtb7Mwi6g9lHA/fMs+OqGyUFpX5aQ3+iZFMWd2yLFpGmZ4vKzrs0q8quFTKV7TbD501uD3vjS3reRL29YgyykzM7dT11u7cNYeJbF7CtyPqcefuPzQx+TCVUW/liqO73s8CK6i39qKfuDi8P9eHsmNK+MdmhCNRtGq2OZ7MveastrhZJZ5A6+HmliUf93EO6VPhxd7U5CpvMinpNFunOpQ8ccvJkxRrcP1eW6RnBIq42YU1tPJ0uQttI2cXsG0lYm0sd+aUtDsnw3N2kLAa1qTo0UuzDqi9fLsKzCnUpHpldUzhWyvH4vEoPR6lgkVw5yxVLCJt/dBXBWhVV4Z9tuwgr6aIfYyKJkX/q9Yt0QIt0WYebLenHpVWshvqpE1O5p9nz8ybbr2L1+DEX74M9DQwfPWOV5cf5MofbcbV1fIkoxlzsleN+M5/G3Y6n5Of18pAYjZsmz+LIn05c16wu5SYSBoobZAL09aoIYUck7mbUgR8998yCdXAv1GvXjJNhKU3CdTFXLgFE/nw+MMIcF6eTrPWRmeXaHAwatJUE4dIbnc/CbD17dqK5qCrr/jqRcQzrZXccByjRZx1RPQOvp4vbfhxmw4k5X4Do4uuCI7P1/UkgovX4yO3wtqz/WpMkxawdl7u7r/lOEklRxMEL50evnKfheCYCR1Oua7OVKm512q16uqNmp6nTO5p5z78vtp2wT8oVsLSOIRwX3XtlwZXRPsHZV8laxzpj5OmqCLdrWWGWPnAdtqter/fTVSOeDrhuXiqLX1XggfvtVqhpq2i2HD+NTMOYOY/3cozX94JAFEmRulFX7K77ayVaK5gIiRwPRCm+H4gD6eY9Mo2VaWvwzX0QSYnSU5Su0lckWb7vd8VIJhImeH3fl3t9Isn4Xkq63yYfPo006DwubYEtbXEEUTJ3MnUM3TmyUTi3BB3Blz2BjXJxbiOouRoYW17oh4Iu22iuhgJ10RhYhhRcgKtOUK6IkRQKZGcozjiX4CRFkQTVRIDQQ9UyEqs5noZbJ9chRMeFRXU1EcJn6LrAyunUcnQXIl1OhFNmCEoV6kkTi9UY+OE28oBsT9Ktk4vPlp+sXM3tOS4MCRI11wE+ngDT8Ss1OVbXve5Xe7nuO+4cJoJbeAh6yNU1qOlCsjPO9lZPXTmtnYmgELfqWQJQkUBlqOuhnbODl9My2QFz9FLzfISQroVSoiNN115svcH4+mzlOrAKtfZcPbBdYASXdOl5FUAuLUihQhMB1RDnS2OXzOBYPQW+fkm2m0XgzrdubkiAGkqYpyeI0Amjk+tp97IxnkOydS9YqkpDrk7OlE7RNpURDQ5LCcwNb3aKt6pL3MoJhBM2xFh23epsHUsBjOEukMuL49NupIOeK7ohEtXCyukSTxLVnOosppVteINd4MEzmbq2M2KXKA8122NdQ47r4KIvQtfdGzvQGHpSjagreOP5FIrhGNIEOJJ+CHNYe7o7hoW7tKfJAnnJxJnCi60B7Hlgl9DEs/UKg7zbTYTkaFAde85MCS6pGPnqs+EOF0gLG08zuuFEx44mpp5OM+iowPahZ2hgZheqDAV6DAq6j1yKohG7wMKVojE8uBPxTKblgfhpL9ag5ObiKs71eWRV3Uhq5Ji6zJ26OZy4OhLnI0dKVAMxMUCi7U7d1PZVGF3meSSHp8VleIK74GKh7tlFQE0EV7U83XQ1cQL9ZIZcqo1oaBvaYGRRqsO8lEMnDAw5P4aTQRPbg0VAwyrIaZVIcI/EYQ1ycWRqiWq4bm77CfSQOAqQPrG3CQV0cyGOmkfScfE7vuqbL/QT3coGMkIhsJA4sryg++N7dfrCUWtTqbCoJCBRaguxEunVMs5nZ8cTMdb0k61Rg3in1JGpFzuxDC905LhzBAtw9AokGNOZDEUoBwIsk91GhAgcbF3PRrtTnThqANAgCAUoeVMwiieDiT2dS4bGVrZ3coDoLgw/OIJJc7ApLbxpXEeTCrlT42D61THapra7O7F4ig5QEFeOgxbIm0/RiJl46+L44u6gEPpY68qOMxORx1xzPF9E05Taud4gP51Z0mmMJm4X5QAEjq4Afyi7E6Uwx+rSpolAXNUyrUpAUgKsYigD17VD714ACHWRVp3tYnjBU3oA+rxrunMIJXYmHrBtP9lZeSphOQX2LtzHkiF79kACHhXhNmVEE3ujLRCCvFQWQqVApIv2tDwFeSLGCAQLWV8gF6JkNIDRJTgneeIHKFeQGC4DanQDNzWsy9wEhb7F3vwUb1E33ELNzq2FXYDGse/leAqUeKsfgA+FIJ/vAc1FyzcGo+xVkyFStJkGdEThHOZ0bLlQf9VyYfFtp5iatvOIj821gVVlQ+p22UT7jCbtst58azwcj6Fm249iX2rLYrvXbYvizcYz4UKDT7a9fFpogf00hOAR18UDPjYPDYlrwpodLvCG1A/7hie4Ybz4MJDlviKJg/5gMLhZPUQ1Ob7MqnxfR4TQW3wbqfYIzlbOzARPxhAMJ7c2NwTj/32yZh81cZ1V16mev7nwcbnb4SLhcyug5eAtf2A7mvECFxga2tMKavrMf2wY3mTFhicnRuoCU/5Y1vlt/n4H3HgGHzuExZ0buPwb2m/RtRHUHPvLwTQwXpkz4DwhuHxMGauah07n65O1v5ysjXf4Uha3l9h5P3f8KOV3C21W7uiPx5G/5eU2+6/bA6a0PJLkKSl3OCsa7pH7G3fHCN69p8zdf3B36T5qX1/jt+uv2Hy/xb1liDH3yN39uOoY83HN2hW5zlm36l4D/sv1/dvq+P2vxX/lu+/ENymh9JWIv/fh9/86UVZ0ItykrYYwjif7kquyiqxxRltNua9j8uMxs/UzNyGMYynhsqJhuIgJNxu3WzNgO0Mw0p5m48cPf4r3NeX4ZcNdyfbQ6Yi9QVtSuu3b7w7FjDSssyMM8wlmuPMWi8+SP19zDJuG7CJKuLRs2PVjtN3S0XL55cI83n349OM79Jn/8OldMZ/bv6dGd9c8qzorGFfuX09UkOO7hCROS+7OJoxlxYZrzg0juy/bHCu5D5++qulz+yWkfYPnG4d26+2vmFGuIYz/EurDV2H+GDS4gfMqeNEVoC90YCUHp+AVDEg2WcNI/TVhjhlLX2xanX1Td2gZY/pSCT423Ne6xG0I41+X+AOme8L951WR3payhPvw6R+J+WfuN277zPE1d9e2X/xsVmfF5o779fV073X76Zb46abb7W1TFq039//J8u6fDMb9xr0gXu84fv3PFtD6UW+5/eOI43m8Z+UfiThjUtHyzF0bM7cua+5VQ5tX0tw2r5R5u7jcaMjFpGbZOosxI+1WhBvS63J8wvHcL7/8wn349M3n5mfuV+7Dp/ct8/M7sf29NDk5c7hIvs71byHpDyaaf8jLV1Rexpevafj3jbsfW75y7AtC30Px6sDn5PwCxzeB45r9HwO/4fyO5N+d5o/H15ceftXtH7D2qvv76p1J62fOMcfmn3YpPiek+PMD511bDEmuChmXxYHU106RNdfnMbC5a1esuWNKCu5IOIr3RZy2WzFmLwy/e4f0bXL+/B79a//4fMf9+uv7Ev5AEL812n11w5VrSH3IYnLDd1WTCteE+3aE+v8NV5Ndyci3bi8XuSnjnLCm3Xptx9feSwp8nSx4viiPX6K9hrjN23/9FtaH+74gfAcmz//U+u8AAAD//5sp6VQsGAAA" -> (known after apply)
        # (7 unchanged attributes hidden)



        # (4 unchanged blocks hidden)
    }

  # aws_launch_template.worker_internal_x86 will be updated in-place
  ~ resource "aws_launch_template" "worker_internal_x86" {
      ~ default_version         = 10 -> (known after apply)
        id                      = "lt-0aae9d85fdd3f7067"
      ~ image_id                = "ami-0a8ee9c8284b8f3ff" -> "ami-07bb20d82c4e502f6"
      ~ latest_version          = 10 -> (known after apply)
        name                    = "imagebuilder_worker_internal_x86_staging"
        tags                    = {
            "AppCode"      = "IMGB-001"
            "Name"         = "🔧 Internal Composer Worker (staging)"
            "ServiceOwner" = "Image Builder"
        }
      ~ user_data               = "H4sIAAAAAAAA/9R4WXOrSJr2vSLqP/C5TsTXHWeQWIRkucsVLSTQSiISkq1nwpFASiBSgCG1njr/fUK2fNpnqenumb4p39hkvls+PPm8Lx6VBSMF451zRR643Z6yrMI16+yyE0n+wkXlvkhwfX68M2aGppoIjIcwuGtdn3iX1E1WFg+c2BZ+av3U4vn3Rj+13mKPs6Yqm4y92GLGcJzuSMH+wq0zSgq8I493WZGxdrze3P3dy6lx0axJzWtFXCZZsXng+lHG3hm8lMzIiXViWu4TPi6Ldbb5qWVkO/JdcT+/t2m19g2pm4cWx/HctYIHjsQSf11scRzHNU36hPcsLevsQpKnnJxfbK8/PHfXNClfN5gbDodDVQYXPBLPsaRdH8dDa6gOh8PR0Bqdtmt9NqOT9agYZDGdnnderam1gyS67LHcnjgiqfrJaHU5itug5xWpRVe+UZFVnYET8OnkPvbMQQfqlZoIl4F+BOeP+XqTDtb7Mwi6g9lHA/fMs+OqGyUFpX5aQ3+iZFMWd2yLFpGmZ4vKzrs0q8quFTKV7TbD501uD3vjS3reRL29YgyykzM7dT11u7cNYeJbF7CtyPqcefuPzQx+TCVUW/liqO73s8CK6i39qKfuDi8P9eHsmNK+MdmhCNRtGq2OZ7MveastrhZJZ5A6+HmliUf93EO6VPhxd7U5CpvMinpNFunOpQ8ccvJkxRrcP1eW6RnBIq42YU1tPJ0uQttI2cXsG0lYm0sd+aUtDsnw3N2kLAa1qTo0UuzDqi9fLsKzCnUpHpldUzhWyvH4vEoPR6lgkVw5yxVLCJt/dBXBWhVV4Z9tuwgr6aIfYyKJkX/q9Yt0QIt0WYebLenHpVWshvqpE1O5p9nz8ybbr2L1+DEX74M9DQwfPWOV5cf5MofbcbV1fIkoxlzsleN+M5/G3Y6n5Of18pAYjZsmz+LIn05c16wu5SYSBoobZAL09aoIYUck7mbUgR8998yCdXAv1GvXjJNhKU3CdTFXLgFE/nw+MMIcF6eTrPWRmeXaHAwatJUE4dIbnc/CbD17dqK5qCrr/jqRcQzrZXccByjRZx1RPQOvp4vbfhxmw4k5X4Do4uuCI7P1/UkgovX4yO3wtqz/WpMkxawdl7u7r/lOEklRxMEL50evnKfheCYCR1Oua7OVKm512q16uqNmp6nTO5p5z78vtp2wT8oVsLSOIRwX3XtlwZXRPsHZV8laxzpj5OmqCLdrWWGWPnAdtqter/fTVSOeDrhuXiqLX1XggfvtVqhpq2i2HD+NTMOYOY/3cozX94JAFEmRulFX7K77ayVaK5gIiRwPRCm+H4gD6eY9Mo2VaWvwzX0QSYnSU5Su0lckWb7vd8VIJhImeH3fl3t9Isn4Xkq63yYfPo006DwubYEtbXEEUTJ3MnUM3TmyUTi3BB3Blz2BjXJxbiOouRoYW17oh4Iu22iuhgJ10RhYhhRcgKtOUK6IkRQKZGcozjiX4CRFkQTVRIDQQ9UyEqs5noZbJ9chRMeFRXU1EcJn6LrAyunUcnQXIl1OhFNmCEoV6kkTi9UY+OE28oBsT9Ktk4vPlp+sXM3tOS4MCRI11wE+ngDT8Ss1OVbXve5Xe7nuO+4cJoJbeAh6yNU1qOlCsjPO9lZPXTmtnYmgELfqWQJQkUBlqOuhnbODl9My2QFz9FLzfISQroVSoiNN115svcH4+mzlOrAKtfZcPbBdYASXdOl5FUAuLUihQhMB1RDnS2OXzOBYPQW+fkm2m0XgzrdubkiAGkqYpyeI0Amjk+tp97IxnkOydS9YqkpDrk7OlE7RNpURDQ5LCcwNb3aKt6pL3MoJhBM2xFh23epsHUsBjOEukMuL49NupIOeK7ohEtXCyukSTxLVnOosppVteINd4MEzmbq2M2KXKA8122NdQ47r4KIvQtfdGzvQGHpSjagreOP5FIrhGNIEOJJ+CHNYe7o7hoW7tKfJAnnJxJnCi60B7Hlgl9DEs/UKg7zbTYTkaFAde85MCS6pGPnqs+EOF0gLG08zuuFEx44mpp5OM+iowPahZ2hgZheqDAV6DAq6j1yKohG7wMKVojE8uBPxTKblgfhpL9ag5ObiKs71eWRV3Uhq5Ji6zJ26OZy4OhLnI0dKVAMxMUCi7U7d1PZVGF3meSSHp8VleIK74GKh7tlFQE0EV7U83XQ1cQL9ZIZcqo1oaBvaYGRRqsO8lEMnDAw5P4aTQRPbg0VAwyrIaZVIcI/EYQ1ycWRqiWq4bm77CfSQOAqQPrG3CQV0cyGOmkfScfE7vuqbL/QT3coGMkIhsJA4sryg++N7dfrCUWtTqbCoJCBRaguxEunVMs5nZ8cTMdb0k61Rg3in1JGpFzuxDC905LhzBAtw9AokGNOZDEUoBwIsk91GhAgcbF3PRrtTnThqANAgCAUoeVMwiieDiT2dS4bGVrZ3coDoLgw/OIJJc7ApLbxpXEeTCrlT42D61THapra7O7F4ig5QEFeOgxbIm0/RiJl46+L44u6gEPpY68qOMxORx1xzPF9E05Taud4gP51Z0mmMJm4X5QAEjq4Afyi7E6Uwx+rSpolAXNUyrUpAUgKsYigD17VD714ACHWRVp3tYnjBU3oA+rxrunMIJXYmHrBtP9lZeSphOQX2LtzHkiF79kACHhXhNmVEE3ujLRCCvFQWQqVApIv2tDwFeSLGCAQLWV8gF6JkNIDRJTgneeIHKFeQGC4DanQDNzWsy9wEhb7F3vwUb1E33ELNzq2FXYDGse/leAqUeKsfgA+FIJ/vAc1FyzcGo+xVkyFStJkGdEThHOZ0bLlQf9VyYfFtp5iatvOIj821gVVlQ+p22UT7jCbtst58azwcj6Fm24+i0JaFtnjfFsWbiWfChQafbHv5tNAC+2kIwSOuiwd8bB4aEteENTtc4A2pH/YNT3DDePFhIMt9RRIH/cFgcLN6iGpyfBlV+b6OCKG3+DZS7RGcrZyZCZ6MIRhObl1uCMb/+2TNPmriOquuQz1/c+HjcrfDRcLnVkDLwVv+wHY04wUtMDS0pxXU9Jn/2DC8yYoNnxWM1AWm/LGs89v4/Q638Qw+dgiLOzds+Tew36JrI6g59peDaWC8MmfAeUJw+ZgyVjUPnc6higkvJKIsKl1Z6CndQSTGCT+4nOr+RTm0vz55+8vJ21fHNt7hS1ncXnTn/Wzyo7q+W2izckd/PLL8LS+32X/dHjCl5ZEkT0m5w1nRcI/c37g7RvDuPa3u/oO7S/dR+/quv11/BfD7Le4tQ4y5R+7ux1XHmI9r1q7IdRa7Vfca8F+u799Wx+9/Uf4r34YnvkkJpa9s/b2Pw//XibKiE+EmbTWEcTzZl1yVVWSNM9pqyn0dkx+Poq2fuQlhHEsJlxUNw0VMuNm43ZoB2xmCkfY0Gz9++FO8rynHLxvuysiHTkfsDdqS0m3ffncoZqRhnR1hmE8ww523WHyW/PmaY9g0ZBdRwqVlw64frO2WjpbLL7fq8e7Dpx9ftM/8h0/vivnc/j3FurvmWdVZwbhy/3qighzfJSRxWnJ3NmEsKzZcc24Y2X3Z5ljJffj0VU2f2y8h7Rs83zi0W29/xYxyDWH8l1Afvgrzx6DBDZxXVYyuAH2hAys5OAWvYECyyRpG6q8Jc8xY+mLT6uybukPLGNOXSvCx4b4WJ25DGP+6xB8w3RPuP6+K9LaUJdyHT/9I8T9zv3HbZ46vubu2/eJnszorNnfcr6+ney/uT7fETzdxb2+bsmi9uf9Plnf/ZDDuN+4F8XrH8et/toDWjxrQ7Z9LHM/jPSv/SMQZk4qWZ+7avbl1WXOvGtq8kua2eaXM28XlRkMuJjXL1lmMGWm3ItyQXpfjE47nfvnlF+7Dp28+ST9zv3IfPr3vq5/fie3vpcnJmcNF8nWufwtJfzD2/ENevqLyMuN8TcO/b9z92PKVY18Q+h6KVwc+J+cXOL4JHNfs/xj4Ded3JP/uNH88vr708Ktu/4C1V93fV+9MWj9zjjk2/7RL8TkhxZ8fOO/aYkhyVci4LA6kvnaKrLk+j4HNXbtizR1TUnBHwlG8L+K03Yoxe2H43Tukb9P15/foX/vH5zvu11/fl/AHgvit0e6rG65cQ+pDFpMbvquaVLgm3Lcj1P9vuJrsSka+dXu5yE0Z54Q17dZrO772XlLg62TB80V5/BLtNcRtKP/rt7A+3PcF4Tswef6n1n8HAAD//zgWMAdQGAAA" -> (known after apply)
        # (7 unchanged attributes hidden)



        # (4 unchanged blocks hidden)
    }

  # aws_spot_fleet_request.workers_external_x86 must be replaced
-/+ resource "aws_spot_fleet_request" "workers_external_x86" {
      ~ client_token                        = "terraform-20210119135209646100000003" -> (known after apply)
      ~ id                                  = "sfr-bc523d73-f1d6-48b6-91de-5ee7ddff59ca" -> (known after apply)
      ~ load_balancers                      = [] -> (known after apply)
      ~ spot_request_state                  = "active" -> (known after apply)
        tags                                = {
            "AppCode"      = "IMGB-001"
            "Name"         = "External worker fleet - staging"
            "ServiceOwner" = "Image Builder"
        }
      ~ target_group_arns                   = [] -> (known after apply)
        # (10 unchanged attributes hidden)

      - launch_template_config { # forces replacement
          - launch_template_specification {
              - id      = "lt-04e6df10bd74694e7" -> null
              - version = "10" -> null
            }

          - overrides {
              - instance_type     = "c5.large" -> null
              - priority          = 0 -> null
              - subnet_id         = "subnet-0c016a02" -> null
              - weighted_capacity = 0 -> null
            }
          - overrides {
              - instance_type     = "c5.xlarge" -> null
              - priority          = 0 -> null
              - subnet_id         = "subnet-0c016a02" -> null
              - weighted_capacity = 0 -> null
            }
          - overrides {
              - instance_type     = "c5a.large" -> null
              - priority          = 0 -> null
              - subnet_id         = "subnet-0c016a02" -> null
              - weighted_capacity = 0 -> null
            }
          - overrides {
              - instance_type     = "c5a.xlarge" -> null
              - priority          = 0 -> null
              - subnet_id         = "subnet-0c016a02" -> null
              - weighted_capacity = 0 -> null
            }
          - overrides {
              - instance_type     = "c5d.large" -> null
              - priority          = 0 -> null
              - subnet_id         = "subnet-0c016a02" -> null
              - weighted_capacity = 0 -> null
            }
          - overrides {
              - instance_type     = "c5d.xlarge" -> null
              - priority          = 0 -> null
              - subnet_id         = "subnet-0c016a02" -> null
              - weighted_capacity = 0 -> null
            }
        }
      + launch_template_config { # forces replacement
          + launch_template_specification {
              + id      = "lt-04e6df10bd74694e7"
              + version = (known after apply)
            }

          + overrides {
              + instance_type     = "c5.large"
              + priority          = (known after apply)
              + spot_price        = (known after apply)
              + subnet_id         = "subnet-0c016a02"
              + weighted_capacity = (known after apply)
            }
          + overrides {
              + instance_type     = "c5.xlarge"
              + priority          = (known after apply)
              + spot_price        = (known after apply)
              + subnet_id         = "subnet-0c016a02"
              + weighted_capacity = (known after apply)
            }
          + overrides {
              + instance_type     = "c5a.large"
              + priority          = (known after apply)
              + spot_price        = (known after apply)
              + subnet_id         = "subnet-0c016a02"
              + weighted_capacity = (known after apply)
            }
          + overrides {
              + instance_type     = "c5a.xlarge"
              + priority          = (known after apply)
              + spot_price        = (known after apply)
              + subnet_id         = "subnet-0c016a02"
              + weighted_capacity = (known after apply)
            }
          + overrides {
              + instance_type     = "c5d.large"
              + priority          = (known after apply)
              + spot_price        = (known after apply)
              + subnet_id         = "subnet-0c016a02"
              + weighted_capacity = (known after apply)
            }
          + overrides {
              + instance_type     = "c5d.xlarge"
              + priority          = (known after apply)
              + spot_price        = (known after apply)
              + subnet_id         = "subnet-0c016a02"
              + weighted_capacity = (known after apply)
            }
        }
    }

  # aws_spot_fleet_request.workers_internal_x86 must be replaced
-/+ resource "aws_spot_fleet_request" "workers_internal_x86" {
      ~ client_token                        = "terraform-20210119135209848700000004" -> (known after apply)
      ~ id                                  = "sfr-ea71ad26-bed8-44b6-a4dd-29b75a08498e" -> (known after apply)
      ~ load_balancers                      = [] -> (known after apply)
      ~ spot_request_state                  = "active" -> (known after apply)
        tags                                = {
            "AppCode"      = "IMGB-001"
            "Name"         = "Image Builder internal worker fleet - staging"
            "ServiceOwner" = "Image Builder"
        }
      ~ target_group_arns                   = [] -> (known after apply)
        # (10 unchanged attributes hidden)

      - launch_template_config { # forces replacement
          - launch_template_specification {
              - id      = "lt-0aae9d85fdd3f7067" -> null
              - version = "10" -> null
            }

          - overrides {
              - instance_type     = "c5.large" -> null
              - priority          = 0 -> null
              - subnet_id         = "subnet-04a176042c3118735" -> null
              - weighted_capacity = 0 -> null
            }
          - overrides {
              - instance_type     = "c5.xlarge" -> null
              - priority          = 0 -> null
              - subnet_id         = "subnet-04a176042c3118735" -> null
              - weighted_capacity = 0 -> null
            }
          - overrides {
              - instance_type     = "c5a.large" -> null
              - priority          = 0 -> null
              - subnet_id         = "subnet-04a176042c3118735" -> null
              - weighted_capacity = 0 -> null
            }
          - overrides {
              - instance_type     = "c5a.xlarge" -> null
              - priority          = 0 -> null
              - subnet_id         = "subnet-04a176042c3118735" -> null
              - weighted_capacity = 0 -> null
            }
          - overrides {
              - instance_type     = "c5d.large" -> null
              - priority          = 0 -> null
              - subnet_id         = "subnet-04a176042c3118735" -> null
              - weighted_capacity = 0 -> null
            }
          - overrides {
              - instance_type     = "c5d.xlarge" -> null
              - priority          = 0 -> null
              - subnet_id         = "subnet-04a176042c3118735" -> null
              - weighted_capacity = 0 -> null
            }
        }
      + launch_template_config { # forces replacement
          + launch_template_specification {
              + id      = "lt-0aae9d85fdd3f7067"
              + version = (known after apply)
            }

          + overrides {
              + instance_type     = "c5.large"
              + priority          = (known after apply)
              + spot_price        = (known after apply)
              + subnet_id         = "subnet-04a176042c3118735"
              + weighted_capacity = (known after apply)
            }
          + overrides {
              + instance_type     = "c5.xlarge"
              + priority          = (known after apply)
              + spot_price        = (known after apply)
              + subnet_id         = "subnet-04a176042c3118735"
              + weighted_capacity = (known after apply)
            }
          + overrides {
              + instance_type     = "c5a.large"
              + priority          = (known after apply)
              + spot_price        = (known after apply)
              + subnet_id         = "subnet-04a176042c3118735"
              + weighted_capacity = (known after apply)
            }
          + overrides {
              + instance_type     = "c5a.xlarge"
              + priority          = (known after apply)
              + spot_price        = (known after apply)
              + subnet_id         = "subnet-04a176042c3118735"
              + weighted_capacity = (known after apply)
            }
          + overrides {
              + instance_type     = "c5d.large"
              + priority          = (known after apply)
              + spot_price        = (known after apply)
              + subnet_id         = "subnet-04a176042c3118735"
              + weighted_capacity = (known after apply)
            }
          + overrides {
              + instance_type     = "c5d.xlarge"
              + priority          = (known after apply)
              + spot_price        = (known after apply)
              + subnet_id         = "subnet-04a176042c3118735"
              + weighted_capacity = (known after apply)
            }
        }
    }

  # aws_volume_attachment.composer_external must be replaced
-/+ resource "aws_volume_attachment" "composer_external" {
      ~ id          = "vai-3851513267" -> (known after apply)
      ~ instance_id = "i-0e5235dca9bc82294" -> (known after apply) # forces replacement
        # (2 unchanged attributes hidden)
    }

  # aws_volume_attachment.composer_internal must be replaced
-/+ resource "aws_volume_attachment" "composer_internal" {
      ~ id          = "vai-3259574331" -> (known after apply)
      ~ instance_id = "i-0aca0a6ea3ad2b2bf" -> (known after apply) # forces replacement
        # (2 unchanged attributes hidden)
    }

Plan: 6 to add, 2 to change, 6 to destroy.

Changes to Outputs:
  ~ rhel8_x86_prebuilt = "RHEL 8 pre-built: imagebuilder-service-image-20210118143243 (ami-0a8ee9c8284b8f3ff)" -> "RHEL 8 pre-built: imagebuilder-service-image-20210119095147 (ami-07bb20d82c4e502f6)"
```

</details>

*Pusher: @ondrejbudai, Action: `pull_request`*